grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
#pragma once 

/* --- PIOD: Parallel Input/Output Controller D --------------------- */

/** @defgroup piod_registers Parallel Input/Output Controller D Register
@{*/

/** PIOD_PER PIO Enable Register **/
#define PIOD_PER			MMIO32(PIOD_BASE + 0x00)
/** PIOD_PDR PIO Disable Register **/
#define PIOD_PDR			MMIO32(PIOD_BASE + 0x04)
/** PIOD_PSR PIO Status Register **/
#define PIOD_PSR			MMIO32(PIOD_BASE + 0x08)
/** PIOD_OER Output Enable Register **/
#define PIOD_OER			MMIO32(PIOD_BASE + 0x10)
/** PIOD_ODR Output Disable Register **/
#define PIOD_ODR			MMIO32(PIOD_BASE + 0x14)
/** PIOD_OSR Output Status Register **/
#define PIOD_OSR			MMIO32(PIOD_BASE + 0x18)
/** PIOD_IFER Glitch Input Filter Enable Register **/
#define PIOD_IFER			MMIO32(PIOD_BASE + 0x20)
/** PIOD_IFDR Glitch Input Filter Disable Register **/
#define PIOD_IFDR			MMIO32(PIOD_BASE + 0x24)
/** PIOD_IFSR Glitch Input Filter Status Register **/
#define PIOD_IFSR			MMIO32(PIOD_BASE + 0x28)
/** PIOD_SODR Set Output Data Register **/
#define PIOD_SODR			MMIO32(PIOD_BASE + 0x30)
/** PIOD_CODR Clear Output Data Register **/
#define PIOD_CODR			MMIO32(PIOD_BASE + 0x34)
/** PIOD_ODSR Output Data Status Register **/
#define PIOD_ODSR			MMIO32(PIOD_BASE + 0x38)
/** PIOD_PDSR Pin Data Status Register **/
#define PIOD_PDSR			MMIO32(PIOD_BASE + 0x3c)
/** PIOD_IER Interrupt Enable Register **/
#define PIOD_IER			MMIO32(PIOD_BASE + 0x40)
/** PIOD_IDR Interrupt Disable Register **/
#define PIOD_IDR			MMIO32(PIOD_BASE + 0x44)
/** PIOD_IMR Interrupt Mask Register **/
#define PIOD_IMR			MMIO32(PIOD_BASE + 0x48)
/** PIOD_ISR Interrupt Status Register **/
#define PIOD_ISR			MMIO32(PIOD_BASE + 0x4c)
/** PIOD_MDER Multi-driver Enable Register **/
#define PIOD_MDER			MMIO32(PIOD_BASE + 0x50)
/** PIOD_MDDR Multi-driver Disable Register **/
#define PIOD_MDDR			MMIO32(PIOD_BASE + 0x54)
/** PIOD_MDSR Multi-driver Status Register **/
#define PIOD_MDSR			MMIO32(PIOD_BASE + 0x58)
/** PIOD_PUDR Pull-up Disable Register **/
#define PIOD_PUDR			MMIO32(PIOD_BASE + 0x60)
/** PIOD_PUER Pull-up Enable Register **/
#define PIOD_PUER			MMIO32(PIOD_BASE + 0x64)
/** PIOD_PUSR Pad Pull-up Status Register **/
#define PIOD_PUSR			MMIO32(PIOD_BASE + 0x68)
/** PIOD_ABSR Peripheral AB Select Register **/
#define PIOD_ABSR			MMIO32(PIOD_BASE + 0x70)
/** PIOD_SCIFSR System Clock Glitch Input Filter Select Register **/
#define PIOD_SCIFSR			MMIO32(PIOD_BASE + 0x80)
/** PIOD_DIFSR Debouncing Input Filter Select Register **/
#define PIOD_DIFSR			MMIO32(PIOD_BASE + 0x84)
/** PIOD_IFDGSR Glitch or Debouncing Input Filter Clock Selection Status Register **/
#define PIOD_IFDGSR			MMIO32(PIOD_BASE + 0x88)
/** PIOD_SCDR Slow Clock Divider Debouncing Register **/
#define PIOD_SCDR			MMIO32(PIOD_BASE + 0x8c)
/** PIOD_OWER Output Write Enable **/
#define PIOD_OWER			MMIO32(PIOD_BASE + 0xa0)
/** PIOD_OWDR Output Write Disable **/
#define PIOD_OWDR			MMIO32(PIOD_BASE + 0xa4)
/** PIOD_OWSR Output Write Status Register **/
#define PIOD_OWSR			MMIO32(PIOD_BASE + 0xa8)
/** PIOD_AIMER Additional Interrupt Modes Enable Register **/
#define PIOD_AIMER			MMIO32(PIOD_BASE + 0xb0)
/** PIOD_AIMDR Additional Interrupt Modes Disables Register **/
#define PIOD_AIMDR			MMIO32(PIOD_BASE + 0xb4)
/** PIOD_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOD_AIMMR			MMIO32(PIOD_BASE + 0xb8)
/** PIOD_ESR Edge Select Register **/
#define PIOD_ESR			MMIO32(PIOD_BASE + 0xc0)
/** PIOD_LSR Level Select Register **/
#define PIOD_LSR			MMIO32(PIOD_BASE + 0xc4)
/** PIOD_ELSR Edge/Level Status Register **/
#define PIOD_ELSR			MMIO32(PIOD_BASE + 0xc8)
/** PIOD_FELLSR Falling Edge/Low Level Select Register **/
#define PIOD_FELLSR			MMIO32(PIOD_BASE + 0xd0)
/** PIOD_REHLSR Rising Edge/ High Level Select Register **/
#define PIOD_REHLSR			MMIO32(PIOD_BASE + 0xd4)
/** PIOD_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOD_FRLHSR			MMIO32(PIOD_BASE + 0xd8)
/** PIOD_LOCKSR Lock Status **/
#define PIOD_LOCKSR			MMIO32(PIOD_BASE + 0xe0)
/** PIOD_WPMR Write Protect Mode Register **/
#define PIOD_WPMR			MMIO32(PIOD_BASE + 0xe4)
/** PIOD_WPSR Write Protect Status Register **/
#define PIOD_WPSR			MMIO32(PIOD_BASE + 0xe8)

/**@}*/


/** @defgroup piod_per PER PIO Enable Register
@{*/

/** PIOD_PER_P31 PIO Enable **/
#define PIOD_PER_P31		(1 << 31)
/** PIOD_PER_P30 PIO Enable **/
#define PIOD_PER_P30		(1 << 30)
/** PIOD_PER_P29 PIO Enable **/
#define PIOD_PER_P29		(1 << 29)
/** PIOD_PER_P28 PIO Enable **/
#define PIOD_PER_P28		(1 << 28)
/** PIOD_PER_P27 PIO Enable **/
#define PIOD_PER_P27		(1 << 27)
/** PIOD_PER_P26 PIO Enable **/
#define PIOD_PER_P26		(1 << 26)
/** PIOD_PER_P25 PIO Enable **/
#define PIOD_PER_P25		(1 << 25)
/** PIOD_PER_P24 PIO Enable **/
#define PIOD_PER_P24		(1 << 24)
/** PIOD_PER_P23 PIO Enable **/
#define PIOD_PER_P23		(1 << 23)
/** PIOD_PER_P22 PIO Enable **/
#define PIOD_PER_P22		(1 << 22)
/** PIOD_PER_P21 PIO Enable **/
#define PIOD_PER_P21		(1 << 21)
/** PIOD_PER_P20 PIO Enable **/
#define PIOD_PER_P20		(1 << 20)
/** PIOD_PER_P19 PIO Enable **/
#define PIOD_PER_P19		(1 << 19)
/** PIOD_PER_P18 PIO Enable **/
#define PIOD_PER_P18		(1 << 18)
/** PIOD_PER_P17 PIO Enable **/
#define PIOD_PER_P17		(1 << 17)
/** PIOD_PER_P16 PIO Enable **/
#define PIOD_PER_P16		(1 << 16)
/** PIOD_PER_P15 PIO Enable **/
#define PIOD_PER_P15		(1 << 15)
/** PIOD_PER_P14 PIO Enable **/
#define PIOD_PER_P14		(1 << 14)
/** PIOD_PER_P13 PIO Enable **/
#define PIOD_PER_P13		(1 << 13)
/** PIOD_PER_P12 PIO Enable **/
#define PIOD_PER_P12		(1 << 12)
/** PIOD_PER_P11 PIO Enable **/
#define PIOD_PER_P11		(1 << 11)
/** PIOD_PER_P10 PIO Enable **/
#define PIOD_PER_P10		(1 << 10)
/** PIOD_PER_P9 PIO Enable **/
#define PIOD_PER_P9		(1 << 9)
/** PIOD_PER_P8 PIO Enable **/
#define PIOD_PER_P8		(1 << 8)
/** PIOD_PER_P7 PIO Enable **/
#define PIOD_PER_P7		(1 << 7)
/** PIOD_PER_P6 PIO Enable **/
#define PIOD_PER_P6		(1 << 6)
/** PIOD_PER_P5 PIO Enable **/
#define PIOD_PER_P5		(1 << 5)
/** PIOD_PER_P4 PIO Enable **/
#define PIOD_PER_P4		(1 << 4)
/** PIOD_PER_P3 PIO Enable **/
#define PIOD_PER_P3		(1 << 3)
/** PIOD_PER_P2 PIO Enable **/
#define PIOD_PER_P2		(1 << 2)
/** PIOD_PER_P1 PIO Enable **/
#define PIOD_PER_P1		(1 << 1)
/** PIOD_PER_P0 PIO Enable **/
#define PIOD_PER_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pdr PDR PIO Disable Register
@{*/

/** PIOD_PDR_P31 PIO Disable **/
#define PIOD_PDR_P31		(1 << 31)
/** PIOD_PDR_P30 PIO Disable **/
#define PIOD_PDR_P30		(1 << 30)
/** PIOD_PDR_P29 PIO Disable **/
#define PIOD_PDR_P29		(1 << 29)
/** PIOD_PDR_P28 PIO Disable **/
#define PIOD_PDR_P28		(1 << 28)
/** PIOD_PDR_P27 PIO Disable **/
#define PIOD_PDR_P27		(1 << 27)
/** PIOD_PDR_P26 PIO Disable **/
#define PIOD_PDR_P26		(1 << 26)
/** PIOD_PDR_P25 PIO Disable **/
#define PIOD_PDR_P25		(1 << 25)
/** PIOD_PDR_P24 PIO Disable **/
#define PIOD_PDR_P24		(1 << 24)
/** PIOD_PDR_P23 PIO Disable **/
#define PIOD_PDR_P23		(1 << 23)
/** PIOD_PDR_P22 PIO Disable **/
#define PIOD_PDR_P22		(1 << 22)
/** PIOD_PDR_P21 PIO Disable **/
#define PIOD_PDR_P21		(1 << 21)
/** PIOD_PDR_P20 PIO Disable **/
#define PIOD_PDR_P20		(1 << 20)
/** PIOD_PDR_P19 PIO Disable **/
#define PIOD_PDR_P19		(1 << 19)
/** PIOD_PDR_P18 PIO Disable **/
#define PIOD_PDR_P18		(1 << 18)
/** PIOD_PDR_P17 PIO Disable **/
#define PIOD_PDR_P17		(1 << 17)
/** PIOD_PDR_P16 PIO Disable **/
#define PIOD_PDR_P16		(1 << 16)
/** PIOD_PDR_P15 PIO Disable **/
#define PIOD_PDR_P15		(1 << 15)
/** PIOD_PDR_P14 PIO Disable **/
#define PIOD_PDR_P14		(1 << 14)
/** PIOD_PDR_P13 PIO Disable **/
#define PIOD_PDR_P13		(1 << 13)
/** PIOD_PDR_P12 PIO Disable **/
#define PIOD_PDR_P12		(1 << 12)
/** PIOD_PDR_P11 PIO Disable **/
#define PIOD_PDR_P11		(1 << 11)
/** PIOD_PDR_P10 PIO Disable **/
#define PIOD_PDR_P10		(1 << 10)
/** PIOD_PDR_P9 PIO Disable **/
#define PIOD_PDR_P9		(1 << 9)
/** PIOD_PDR_P8 PIO Disable **/
#define PIOD_PDR_P8		(1 << 8)
/** PIOD_PDR_P7 PIO Disable **/
#define PIOD_PDR_P7		(1 << 7)
/** PIOD_PDR_P6 PIO Disable **/
#define PIOD_PDR_P6		(1 << 6)
/** PIOD_PDR_P5 PIO Disable **/
#define PIOD_PDR_P5		(1 << 5)
/** PIOD_PDR_P4 PIO Disable **/
#define PIOD_PDR_P4		(1 << 4)
/** PIOD_PDR_P3 PIO Disable **/
#define PIOD_PDR_P3		(1 << 3)
/** PIOD_PDR_P2 PIO Disable **/
#define PIOD_PDR_P2		(1 << 2)
/** PIOD_PDR_P1 PIO Disable **/
#define PIOD_PDR_P1		(1 << 1)
/** PIOD_PDR_P0 PIO Disable **/
#define PIOD_PDR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_psr PSR PIO Status Register
@{*/

/** PIOD_PSR_P31 PIO Status **/
#define PIOD_PSR_P31		(1 << 31)
/** PIOD_PSR_P30 PIO Status **/
#define PIOD_PSR_P30		(1 << 30)
/** PIOD_PSR_P29 PIO Status **/
#define PIOD_PSR_P29		(1 << 29)
/** PIOD_PSR_P28 PIO Status **/
#define PIOD_PSR_P28		(1 << 28)
/** PIOD_PSR_P27 PIO Status **/
#define PIOD_PSR_P27		(1 << 27)
/** PIOD_PSR_P26 PIO Status **/
#define PIOD_PSR_P26		(1 << 26)
/** PIOD_PSR_P25 PIO Status **/
#define PIOD_PSR_P25		(1 << 25)
/** PIOD_PSR_P24 PIO Status **/
#define PIOD_PSR_P24		(1 << 24)
/** PIOD_PSR_P23 PIO Status **/
#define PIOD_PSR_P23		(1 << 23)
/** PIOD_PSR_P22 PIO Status **/
#define PIOD_PSR_P22		(1 << 22)
/** PIOD_PSR_P21 PIO Status **/
#define PIOD_PSR_P21		(1 << 21)
/** PIOD_PSR_P20 PIO Status **/
#define PIOD_PSR_P20		(1 << 20)
/** PIOD_PSR_P19 PIO Status **/
#define PIOD_PSR_P19		(1 << 19)
/** PIOD_PSR_P18 PIO Status **/
#define PIOD_PSR_P18		(1 << 18)
/** PIOD_PSR_P17 PIO Status **/
#define PIOD_PSR_P17		(1 << 17)
/** PIOD_PSR_P16 PIO Status **/
#define PIOD_PSR_P16		(1 << 16)
/** PIOD_PSR_P15 PIO Status **/
#define PIOD_PSR_P15		(1 << 15)
/** PIOD_PSR_P14 PIO Status **/
#define PIOD_PSR_P14		(1 << 14)
/** PIOD_PSR_P13 PIO Status **/
#define PIOD_PSR_P13		(1 << 13)
/** PIOD_PSR_P12 PIO Status **/
#define PIOD_PSR_P12		(1 << 12)
/** PIOD_PSR_P11 PIO Status **/
#define PIOD_PSR_P11		(1 << 11)
/** PIOD_PSR_P10 PIO Status **/
#define PIOD_PSR_P10		(1 << 10)
/** PIOD_PSR_P9 PIO Status **/
#define PIOD_PSR_P9		(1 << 9)
/** PIOD_PSR_P8 PIO Status **/
#define PIOD_PSR_P8		(1 << 8)
/** PIOD_PSR_P7 PIO Status **/
#define PIOD_PSR_P7		(1 << 7)
/** PIOD_PSR_P6 PIO Status **/
#define PIOD_PSR_P6		(1 << 6)
/** PIOD_PSR_P5 PIO Status **/
#define PIOD_PSR_P5		(1 << 5)
/** PIOD_PSR_P4 PIO Status **/
#define PIOD_PSR_P4		(1 << 4)
/** PIOD_PSR_P3 PIO Status **/
#define PIOD_PSR_P3		(1 << 3)
/** PIOD_PSR_P2 PIO Status **/
#define PIOD_PSR_P2		(1 << 2)
/** PIOD_PSR_P1 PIO Status **/
#define PIOD_PSR_P1		(1 << 1)
/** PIOD_PSR_P0 PIO Status **/
#define PIOD_PSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_oer OER Output Enable Register
@{*/

/** PIOD_OER_P31 Output Enable **/
#define PIOD_OER_P31		(1 << 31)
/** PIOD_OER_P30 Output Enable **/
#define PIOD_OER_P30		(1 << 30)
/** PIOD_OER_P29 Output Enable **/
#define PIOD_OER_P29		(1 << 29)
/** PIOD_OER_P28 Output Enable **/
#define PIOD_OER_P28		(1 << 28)
/** PIOD_OER_P27 Output Enable **/
#define PIOD_OER_P27		(1 << 27)
/** PIOD_OER_P26 Output Enable **/
#define PIOD_OER_P26		(1 << 26)
/** PIOD_OER_P25 Output Enable **/
#define PIOD_OER_P25		(1 << 25)
/** PIOD_OER_P24 Output Enable **/
#define PIOD_OER_P24		(1 << 24)
/** PIOD_OER_P23 Output Enable **/
#define PIOD_OER_P23		(1 << 23)
/** PIOD_OER_P22 Output Enable **/
#define PIOD_OER_P22		(1 << 22)
/** PIOD_OER_P21 Output Enable **/
#define PIOD_OER_P21		(1 << 21)
/** PIOD_OER_P20 Output Enable **/
#define PIOD_OER_P20		(1 << 20)
/** PIOD_OER_P19 Output Enable **/
#define PIOD_OER_P19		(1 << 19)
/** PIOD_OER_P18 Output Enable **/
#define PIOD_OER_P18		(1 << 18)
/** PIOD_OER_P17 Output Enable **/
#define PIOD_OER_P17		(1 << 17)
/** PIOD_OER_P16 Output Enable **/
#define PIOD_OER_P16		(1 << 16)
/** PIOD_OER_P15 Output Enable **/
#define PIOD_OER_P15		(1 << 15)
/** PIOD_OER_P14 Output Enable **/
#define PIOD_OER_P14		(1 << 14)
/** PIOD_OER_P13 Output Enable **/
#define PIOD_OER_P13		(1 << 13)
/** PIOD_OER_P12 Output Enable **/
#define PIOD_OER_P12		(1 << 12)
/** PIOD_OER_P11 Output Enable **/
#define PIOD_OER_P11		(1 << 11)
/** PIOD_OER_P10 Output Enable **/
#define PIOD_OER_P10		(1 << 10)
/** PIOD_OER_P9 Output Enable **/
#define PIOD_OER_P9		(1 << 9)
/** PIOD_OER_P8 Output Enable **/
#define PIOD_OER_P8		(1 << 8)
/** PIOD_OER_P7 Output Enable **/
#define PIOD_OER_P7		(1 << 7)
/** PIOD_OER_P6 Output Enable **/
#define PIOD_OER_P6		(1 << 6)
/** PIOD_OER_P5 Output Enable **/
#define PIOD_OER_P5		(1 << 5)
/** PIOD_OER_P4 Output Enable **/
#define PIOD_OER_P4		(1 << 4)
/** PIOD_OER_P3 Output Enable **/
#define PIOD_OER_P3		(1 << 3)
/** PIOD_OER_P2 Output Enable **/
#define PIOD_OER_P2		(1 << 2)
/** PIOD_OER_P1 Output Enable **/
#define PIOD_OER_P1		(1 << 1)
/** PIOD_OER_P0 Output Enable **/
#define PIOD_OER_P0		(1 << 0)

/**@}*/

