grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** @defgroup piod_odr ODR Output Disable Register
@{*/

/** PIOD_ODR_P31 Output Disable **/
#define PIOD_ODR_P31		(1 << 31)
/** PIOD_ODR_P30 Output Disable **/
#define PIOD_ODR_P30		(1 << 30)
/** PIOD_ODR_P29 Output Disable **/
#define PIOD_ODR_P29		(1 << 29)
/** PIOD_ODR_P28 Output Disable **/
#define PIOD_ODR_P28		(1 << 28)
/** PIOD_ODR_P27 Output Disable **/
#define PIOD_ODR_P27		(1 << 27)
/** PIOD_ODR_P26 Output Disable **/
#define PIOD_ODR_P26		(1 << 26)
/** PIOD_ODR_P25 Output Disable **/
#define PIOD_ODR_P25		(1 << 25)
/** PIOD_ODR_P24 Output Disable **/
#define PIOD_ODR_P24		(1 << 24)
/** PIOD_ODR_P23 Output Disable **/
#define PIOD_ODR_P23		(1 << 23)
/** PIOD_ODR_P22 Output Disable **/
#define PIOD_ODR_P22		(1 << 22)
/** PIOD_ODR_P21 Output Disable **/
#define PIOD_ODR_P21		(1 << 21)
/** PIOD_ODR_P20 Output Disable **/
#define PIOD_ODR_P20		(1 << 20)
/** PIOD_ODR_P19 Output Disable **/
#define PIOD_ODR_P19		(1 << 19)
/** PIOD_ODR_P18 Output Disable **/
#define PIOD_ODR_P18		(1 << 18)
/** PIOD_ODR_P17 Output Disable **/
#define PIOD_ODR_P17		(1 << 17)
/** PIOD_ODR_P16 Output Disable **/
#define PIOD_ODR_P16		(1 << 16)
/** PIOD_ODR_P15 Output Disable **/
#define PIOD_ODR_P15		(1 << 15)
/** PIOD_ODR_P14 Output Disable **/
#define PIOD_ODR_P14		(1 << 14)
/** PIOD_ODR_P13 Output Disable **/
#define PIOD_ODR_P13		(1 << 13)
/** PIOD_ODR_P12 Output Disable **/
#define PIOD_ODR_P12		(1 << 12)
/** PIOD_ODR_P11 Output Disable **/
#define PIOD_ODR_P11		(1 << 11)
/** PIOD_ODR_P10 Output Disable **/
#define PIOD_ODR_P10		(1 << 10)
/** PIOD_ODR_P9 Output Disable **/
#define PIOD_ODR_P9		(1 << 9)
/** PIOD_ODR_P8 Output Disable **/
#define PIOD_ODR_P8		(1 << 8)
/** PIOD_ODR_P7 Output Disable **/
#define PIOD_ODR_P7		(1 << 7)
/** PIOD_ODR_P6 Output Disable **/
#define PIOD_ODR_P6		(1 << 6)
/** PIOD_ODR_P5 Output Disable **/
#define PIOD_ODR_P5		(1 << 5)
/** PIOD_ODR_P4 Output Disable **/
#define PIOD_ODR_P4		(1 << 4)
/** PIOD_ODR_P3 Output Disable **/
#define PIOD_ODR_P3		(1 << 3)
/** PIOD_ODR_P2 Output Disable **/
#define PIOD_ODR_P2		(1 << 2)
/** PIOD_ODR_P1 Output Disable **/
#define PIOD_ODR_P1		(1 << 1)
/** PIOD_ODR_P0 Output Disable **/
#define PIOD_ODR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_osr OSR Output Status Register
@{*/

/** PIOD_OSR_P31 Output Status **/
#define PIOD_OSR_P31		(1 << 31)
/** PIOD_OSR_P30 Output Status **/
#define PIOD_OSR_P30		(1 << 30)
/** PIOD_OSR_P29 Output Status **/
#define PIOD_OSR_P29		(1 << 29)
/** PIOD_OSR_P28 Output Status **/
#define PIOD_OSR_P28		(1 << 28)
/** PIOD_OSR_P27 Output Status **/
#define PIOD_OSR_P27		(1 << 27)
/** PIOD_OSR_P26 Output Status **/
#define PIOD_OSR_P26		(1 << 26)
/** PIOD_OSR_P25 Output Status **/
#define PIOD_OSR_P25		(1 << 25)
/** PIOD_OSR_P24 Output Status **/
#define PIOD_OSR_P24		(1 << 24)
/** PIOD_OSR_P23 Output Status **/
#define PIOD_OSR_P23		(1 << 23)
/** PIOD_OSR_P22 Output Status **/
#define PIOD_OSR_P22		(1 << 22)
/** PIOD_OSR_P21 Output Status **/
#define PIOD_OSR_P21		(1 << 21)
/** PIOD_OSR_P20 Output Status **/
#define PIOD_OSR_P20		(1 << 20)
/** PIOD_OSR_P19 Output Status **/
#define PIOD_OSR_P19		(1 << 19)
/** PIOD_OSR_P18 Output Status **/
#define PIOD_OSR_P18		(1 << 18)
/** PIOD_OSR_P17 Output Status **/
#define PIOD_OSR_P17		(1 << 17)
/** PIOD_OSR_P16 Output Status **/
#define PIOD_OSR_P16		(1 << 16)
/** PIOD_OSR_P15 Output Status **/
#define PIOD_OSR_P15		(1 << 15)
/** PIOD_OSR_P14 Output Status **/
#define PIOD_OSR_P14		(1 << 14)
/** PIOD_OSR_P13 Output Status **/
#define PIOD_OSR_P13		(1 << 13)
/** PIOD_OSR_P12 Output Status **/
#define PIOD_OSR_P12		(1 << 12)
/** PIOD_OSR_P11 Output Status **/
#define PIOD_OSR_P11		(1 << 11)
/** PIOD_OSR_P10 Output Status **/
#define PIOD_OSR_P10		(1 << 10)
/** PIOD_OSR_P9 Output Status **/
#define PIOD_OSR_P9		(1 << 9)
/** PIOD_OSR_P8 Output Status **/
#define PIOD_OSR_P8		(1 << 8)
/** PIOD_OSR_P7 Output Status **/
#define PIOD_OSR_P7		(1 << 7)
/** PIOD_OSR_P6 Output Status **/
#define PIOD_OSR_P6		(1 << 6)
/** PIOD_OSR_P5 Output Status **/
#define PIOD_OSR_P5		(1 << 5)
/** PIOD_OSR_P4 Output Status **/
#define PIOD_OSR_P4		(1 << 4)
/** PIOD_OSR_P3 Output Status **/
#define PIOD_OSR_P3		(1 << 3)
/** PIOD_OSR_P2 Output Status **/
#define PIOD_OSR_P2		(1 << 2)
/** PIOD_OSR_P1 Output Status **/
#define PIOD_OSR_P1		(1 << 1)
/** PIOD_OSR_P0 Output Status **/
#define PIOD_OSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_ifer IFER Glitch Input Filter Enable Register
@{*/

/** PIOD_IFER_P31 Input Filter Enable **/
#define PIOD_IFER_P31		(1 << 31)
/** PIOD_IFER_P30 Input Filter Enable **/
#define PIOD_IFER_P30		(1 << 30)
/** PIOD_IFER_P29 Input Filter Enable **/
#define PIOD_IFER_P29		(1 << 29)
/** PIOD_IFER_P28 Input Filter Enable **/
#define PIOD_IFER_P28		(1 << 28)
/** PIOD_IFER_P27 Input Filter Enable **/
#define PIOD_IFER_P27		(1 << 27)
/** PIOD_IFER_P26 Input Filter Enable **/
#define PIOD_IFER_P26		(1 << 26)
/** PIOD_IFER_P25 Input Filter Enable **/
#define PIOD_IFER_P25		(1 << 25)
/** PIOD_IFER_P24 Input Filter Enable **/
#define PIOD_IFER_P24		(1 << 24)
/** PIOD_IFER_P23 Input Filter Enable **/
#define PIOD_IFER_P23		(1 << 23)
/** PIOD_IFER_P22 Input Filter Enable **/
#define PIOD_IFER_P22		(1 << 22)
/** PIOD_IFER_P21 Input Filter Enable **/
#define PIOD_IFER_P21		(1 << 21)
/** PIOD_IFER_P20 Input Filter Enable **/
#define PIOD_IFER_P20		(1 << 20)
/** PIOD_IFER_P19 Input Filter Enable **/
#define PIOD_IFER_P19		(1 << 19)
/** PIOD_IFER_P18 Input Filter Enable **/
#define PIOD_IFER_P18		(1 << 18)
/** PIOD_IFER_P17 Input Filter Enable **/
#define PIOD_IFER_P17		(1 << 17)
/** PIOD_IFER_P16 Input Filter Enable **/
#define PIOD_IFER_P16		(1 << 16)
/** PIOD_IFER_P15 Input Filter Enable **/
#define PIOD_IFER_P15		(1 << 15)
/** PIOD_IFER_P14 Input Filter Enable **/
#define PIOD_IFER_P14		(1 << 14)
/** PIOD_IFER_P13 Input Filter Enable **/
#define PIOD_IFER_P13		(1 << 13)
/** PIOD_IFER_P12 Input Filter Enable **/
#define PIOD_IFER_P12		(1 << 12)
/** PIOD_IFER_P11 Input Filter Enable **/
#define PIOD_IFER_P11		(1 << 11)
/** PIOD_IFER_P10 Input Filter Enable **/
#define PIOD_IFER_P10		(1 << 10)
/** PIOD_IFER_P9 Input Filter Enable **/
#define PIOD_IFER_P9		(1 << 9)
/** PIOD_IFER_P8 Input Filter Enable **/
#define PIOD_IFER_P8		(1 << 8)
/** PIOD_IFER_P7 Input Filter Enable **/
#define PIOD_IFER_P7		(1 << 7)
/** PIOD_IFER_P6 Input Filter Enable **/
#define PIOD_IFER_P6		(1 << 6)
/** PIOD_IFER_P5 Input Filter Enable **/
#define PIOD_IFER_P5		(1 << 5)
/** PIOD_IFER_P4 Input Filter Enable **/
#define PIOD_IFER_P4		(1 << 4)
/** PIOD_IFER_P3 Input Filter Enable **/
#define PIOD_IFER_P3		(1 << 3)
/** PIOD_IFER_P2 Input Filter Enable **/
#define PIOD_IFER_P2		(1 << 2)
/** PIOD_IFER_P1 Input Filter Enable **/
#define PIOD_IFER_P1		(1 << 1)
/** PIOD_IFER_P0 Input Filter Enable **/
#define PIOD_IFER_P0		(1 << 0)

/**@}*/

/** @defgroup piod_ifdr IFDR Glitch Input Filter Disable Register
@{*/

/** PIOD_IFDR_P31 Input Filter Disable **/
#define PIOD_IFDR_P31		(1 << 31)
/** PIOD_IFDR_P30 Input Filter Disable **/
#define PIOD_IFDR_P30		(1 << 30)
/** PIOD_IFDR_P29 Input Filter Disable **/
#define PIOD_IFDR_P29		(1 << 29)
/** PIOD_IFDR_P28 Input Filter Disable **/
#define PIOD_IFDR_P28		(1 << 28)
/** PIOD_IFDR_P27 Input Filter Disable **/
#define PIOD_IFDR_P27		(1 << 27)
/** PIOD_IFDR_P26 Input Filter Disable **/
#define PIOD_IFDR_P26		(1 << 26)
/** PIOD_IFDR_P25 Input Filter Disable **/
#define PIOD_IFDR_P25		(1 << 25)
/** PIOD_IFDR_P24 Input Filter Disable **/
#define PIOD_IFDR_P24		(1 << 24)
/** PIOD_IFDR_P23 Input Filter Disable **/
#define PIOD_IFDR_P23		(1 << 23)
/** PIOD_IFDR_P22 Input Filter Disable **/
#define PIOD_IFDR_P22		(1 << 22)
/** PIOD_IFDR_P21 Input Filter Disable **/
#define PIOD_IFDR_P21		(1 << 21)
/** PIOD_IFDR_P20 Input Filter Disable **/
#define PIOD_IFDR_P20		(1 << 20)
/** PIOD_IFDR_P19 Input Filter Disable **/
#define PIOD_IFDR_P19		(1 << 19)
/** PIOD_IFDR_P18 Input Filter Disable **/
#define PIOD_IFDR_P18		(1 << 18)
/** PIOD_IFDR_P17 Input Filter Disable **/
#define PIOD_IFDR_P17		(1 << 17)
/** PIOD_IFDR_P16 Input Filter Disable **/
#define PIOD_IFDR_P16		(1 << 16)
/** PIOD_IFDR_P15 Input Filter Disable **/
#define PIOD_IFDR_P15		(1 << 15)
/** PIOD_IFDR_P14 Input Filter Disable **/
#define PIOD_IFDR_P14		(1 << 14)
/** PIOD_IFDR_P13 Input Filter Disable **/
#define PIOD_IFDR_P13		(1 << 13)
/** PIOD_IFDR_P12 Input Filter Disable **/
#define PIOD_IFDR_P12		(1 << 12)
/** PIOD_IFDR_P11 Input Filter Disable **/
#define PIOD_IFDR_P11		(1 << 11)
/** PIOD_IFDR_P10 Input Filter Disable **/
#define PIOD_IFDR_P10		(1 << 10)
/** PIOD_IFDR_P9 Input Filter Disable **/
#define PIOD_IFDR_P9		(1 << 9)
/** PIOD_IFDR_P8 Input Filter Disable **/
#define PIOD_IFDR_P8		(1 << 8)
/** PIOD_IFDR_P7 Input Filter Disable **/
#define PIOD_IFDR_P7		(1 << 7)
/** PIOD_IFDR_P6 Input Filter Disable **/
#define PIOD_IFDR_P6		(1 << 6)
/** PIOD_IFDR_P5 Input Filter Disable **/
#define PIOD_IFDR_P5		(1 << 5)
/** PIOD_IFDR_P4 Input Filter Disable **/
#define PIOD_IFDR_P4		(1 << 4)
/** PIOD_IFDR_P3 Input Filter Disable **/
#define PIOD_IFDR_P3		(1 << 3)
/** PIOD_IFDR_P2 Input Filter Disable **/
#define PIOD_IFDR_P2		(1 << 2)
/** PIOD_IFDR_P1 Input Filter Disable **/
#define PIOD_IFDR_P1		(1 << 1)
/** PIOD_IFDR_P0 Input Filter Disable **/
#define PIOD_IFDR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_ifsr IFSR Glitch Input Filter Status Register
@{*/

/** PIOD_IFSR_P31 Input Filer Status **/
#define PIOD_IFSR_P31		(1 << 31)
/** PIOD_IFSR_P30 Input Filer Status **/
#define PIOD_IFSR_P30		(1 << 30)
/** PIOD_IFSR_P29 Input Filer Status **/
#define PIOD_IFSR_P29		(1 << 29)
/** PIOD_IFSR_P28 Input Filer Status **/
#define PIOD_IFSR_P28		(1 << 28)
/** PIOD_IFSR_P27 Input Filer Status **/
#define PIOD_IFSR_P27		(1 << 27)
/** PIOD_IFSR_P26 Input Filer Status **/
#define PIOD_IFSR_P26		(1 << 26)
/** PIOD_IFSR_P25 Input Filer Status **/
#define PIOD_IFSR_P25		(1 << 25)
/** PIOD_IFSR_P24 Input Filer Status **/
#define PIOD_IFSR_P24		(1 << 24)
/** PIOD_IFSR_P23 Input Filer Status **/
#define PIOD_IFSR_P23		(1 << 23)
/** PIOD_IFSR_P22 Input Filer Status **/
#define PIOD_IFSR_P22		(1 << 22)
/** PIOD_IFSR_P21 Input Filer Status **/
#define PIOD_IFSR_P21		(1 << 21)
/** PIOD_IFSR_P20 Input Filer Status **/
#define PIOD_IFSR_P20		(1 << 20)
/** PIOD_IFSR_P19 Input Filer Status **/
#define PIOD_IFSR_P19		(1 << 19)
/** PIOD_IFSR_P18 Input Filer Status **/
#define PIOD_IFSR_P18		(1 << 18)
/** PIOD_IFSR_P17 Input Filer Status **/
#define PIOD_IFSR_P17		(1 << 17)
/** PIOD_IFSR_P16 Input Filer Status **/
#define PIOD_IFSR_P16		(1 << 16)
/** PIOD_IFSR_P15 Input Filer Status **/
#define PIOD_IFSR_P15		(1 << 15)
/** PIOD_IFSR_P14 Input Filer Status **/
#define PIOD_IFSR_P14		(1 << 14)
/** PIOD_IFSR_P13 Input Filer Status **/
#define PIOD_IFSR_P13		(1 << 13)
/** PIOD_IFSR_P12 Input Filer Status **/
#define PIOD_IFSR_P12		(1 << 12)
/** PIOD_IFSR_P11 Input Filer Status **/
#define PIOD_IFSR_P11		(1 << 11)
/** PIOD_IFSR_P10 Input Filer Status **/
#define PIOD_IFSR_P10		(1 << 10)
/** PIOD_IFSR_P9 Input Filer Status **/
#define PIOD_IFSR_P9		(1 << 9)
/** PIOD_IFSR_P8 Input Filer Status **/
#define PIOD_IFSR_P8		(1 << 8)
/** PIOD_IFSR_P7 Input Filer Status **/
#define PIOD_IFSR_P7		(1 << 7)
/** PIOD_IFSR_P6 Input Filer Status **/
#define PIOD_IFSR_P6		(1 << 6)
/** PIOD_IFSR_P5 Input Filer Status **/
#define PIOD_IFSR_P5		(1 << 5)
/** PIOD_IFSR_P4 Input Filer Status **/
#define PIOD_IFSR_P4		(1 << 4)
/** PIOD_IFSR_P3 Input Filer Status **/
#define PIOD_IFSR_P3		(1 << 3)
/** PIOD_IFSR_P2 Input Filer Status **/
#define PIOD_IFSR_P2		(1 << 2)
/** PIOD_IFSR_P1 Input Filer Status **/
#define PIOD_IFSR_P1		(1 << 1)
/** PIOD_IFSR_P0 Input Filer Status **/
#define PIOD_IFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_sodr SODR Set Output Data Register
@{*/

/** PIOD_SODR_P31 Set Output Data **/
#define PIOD_SODR_P31		(1 << 31)
/** PIOD_SODR_P30 Set Output Data **/
#define PIOD_SODR_P30		(1 << 30)
/** PIOD_SODR_P29 Set Output Data **/
#define PIOD_SODR_P29		(1 << 29)
/** PIOD_SODR_P28 Set Output Data **/
#define PIOD_SODR_P28		(1 << 28)
/** PIOD_SODR_P27 Set Output Data **/
#define PIOD_SODR_P27		(1 << 27)
/** PIOD_SODR_P26 Set Output Data **/
#define PIOD_SODR_P26		(1 << 26)
/** PIOD_SODR_P25 Set Output Data **/
#define PIOD_SODR_P25		(1 << 25)
/** PIOD_SODR_P24 Set Output Data **/
#define PIOD_SODR_P24		(1 << 24)
/** PIOD_SODR_P23 Set Output Data **/
#define PIOD_SODR_P23		(1 << 23)
/** PIOD_SODR_P22 Set Output Data **/
#define PIOD_SODR_P22		(1 << 22)
/** PIOD_SODR_P21 Set Output Data **/
#define PIOD_SODR_P21		(1 << 21)
/** PIOD_SODR_P20 Set Output Data **/
#define PIOD_SODR_P20		(1 << 20)
/** PIOD_SODR_P19 Set Output Data **/
#define PIOD_SODR_P19		(1 << 19)
/** PIOD_SODR_P18 Set Output Data **/
#define PIOD_SODR_P18		(1 << 18)
/** PIOD_SODR_P17 Set Output Data **/
#define PIOD_SODR_P17		(1 << 17)
/** PIOD_SODR_P16 Set Output Data **/
#define PIOD_SODR_P16		(1 << 16)
/** PIOD_SODR_P15 Set Output Data **/
#define PIOD_SODR_P15		(1 << 15)
/** PIOD_SODR_P14 Set Output Data **/
#define PIOD_SODR_P14		(1 << 14)
/** PIOD_SODR_P13 Set Output Data **/
#define PIOD_SODR_P13		(1 << 13)
/** PIOD_SODR_P12 Set Output Data **/
#define PIOD_SODR_P12		(1 << 12)
/** PIOD_SODR_P11 Set Output Data **/
#define PIOD_SODR_P11		(1 << 11)
/** PIOD_SODR_P10 Set Output Data **/
#define PIOD_SODR_P10		(1 << 10)
/** PIOD_SODR_P9 Set Output Data **/
#define PIOD_SODR_P9		(1 << 9)
/** PIOD_SODR_P8 Set Output Data **/
#define PIOD_SODR_P8		(1 << 8)
/** PIOD_SODR_P7 Set Output Data **/
#define PIOD_SODR_P7		(1 << 7)
/** PIOD_SODR_P6 Set Output Data **/
#define PIOD_SODR_P6		(1 << 6)
/** PIOD_SODR_P5 Set Output Data **/
#define PIOD_SODR_P5		(1 << 5)
/** PIOD_SODR_P4 Set Output Data **/
#define PIOD_SODR_P4		(1 << 4)
/** PIOD_SODR_P3 Set Output Data **/
#define PIOD_SODR_P3		(1 << 3)
/** PIOD_SODR_P2 Set Output Data **/
#define PIOD_SODR_P2		(1 << 2)
/** PIOD_SODR_P1 Set Output Data **/
#define PIOD_SODR_P1		(1 << 1)
/** PIOD_SODR_P0 Set Output Data **/
#define PIOD_SODR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_codr CODR Clear Output Data Register
@{*/

/** PIOD_CODR_P31 Clear Output Data **/
#define PIOD_CODR_P31		(1 << 31)
/** PIOD_CODR_P30 Clear Output Data **/
#define PIOD_CODR_P30		(1 << 30)
/** PIOD_CODR_P29 Clear Output Data **/
#define PIOD_CODR_P29		(1 << 29)
/** PIOD_CODR_P28 Clear Output Data **/
#define PIOD_CODR_P28		(1 << 28)
/** PIOD_CODR_P27 Clear Output Data **/
#define PIOD_CODR_P27		(1 << 27)
/** PIOD_CODR_P26 Clear Output Data **/
#define PIOD_CODR_P26		(1 << 26)
/** PIOD_CODR_P25 Clear Output Data **/
#define PIOD_CODR_P25		(1 << 25)
/** PIOD_CODR_P24 Clear Output Data **/
#define PIOD_CODR_P24		(1 << 24)
/** PIOD_CODR_P23 Clear Output Data **/
#define PIOD_CODR_P23		(1 << 23)
/** PIOD_CODR_P22 Clear Output Data **/
#define PIOD_CODR_P22		(1 << 22)
/** PIOD_CODR_P21 Clear Output Data **/
#define PIOD_CODR_P21		(1 << 21)
/** PIOD_CODR_P20 Clear Output Data **/
#define PIOD_CODR_P20		(1 << 20)
/** PIOD_CODR_P19 Clear Output Data **/
#define PIOD_CODR_P19		(1 << 19)
/** PIOD_CODR_P18 Clear Output Data **/
#define PIOD_CODR_P18		(1 << 18)
/** PIOD_CODR_P17 Clear Output Data **/
#define PIOD_CODR_P17		(1 << 17)
/** PIOD_CODR_P16 Clear Output Data **/
#define PIOD_CODR_P16		(1 << 16)
/** PIOD_CODR_P15 Clear Output Data **/
#define PIOD_CODR_P15		(1 << 15)
/** PIOD_CODR_P14 Clear Output Data **/
#define PIOD_CODR_P14		(1 << 14)
/** PIOD_CODR_P13 Clear Output Data **/
#define PIOD_CODR_P13		(1 << 13)
/** PIOD_CODR_P12 Clear Output Data **/
#define PIOD_CODR_P12		(1 << 12)
/** PIOD_CODR_P11 Clear Output Data **/
#define PIOD_CODR_P11		(1 << 11)
/** PIOD_CODR_P10 Clear Output Data **/
#define PIOD_CODR_P10		(1 << 10)
/** PIOD_CODR_P9 Clear Output Data **/
#define PIOD_CODR_P9		(1 << 9)
/** PIOD_CODR_P8 Clear Output Data **/
#define PIOD_CODR_P8		(1 << 8)
/** PIOD_CODR_P7 Clear Output Data **/
#define PIOD_CODR_P7		(1 << 7)
/** PIOD_CODR_P6 Clear Output Data **/
#define PIOD_CODR_P6		(1 << 6)
/** PIOD_CODR_P5 Clear Output Data **/
#define PIOD_CODR_P5		(1 << 5)
/** PIOD_CODR_P4 Clear Output Data **/
#define PIOD_CODR_P4		(1 << 4)
/** PIOD_CODR_P3 Clear Output Data **/
#define PIOD_CODR_P3		(1 << 3)
/** PIOD_CODR_P2 Clear Output Data **/
#define PIOD_CODR_P2		(1 << 2)
/** PIOD_CODR_P1 Clear Output Data **/
#define PIOD_CODR_P1		(1 << 1)
/** PIOD_CODR_P0 Clear Output Data **/
#define PIOD_CODR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_odsr ODSR Output Data Status Register
@{*/

