grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** PIOD_ODSR_P31 Output Data Status **/
#define PIOD_ODSR_P31		(1 << 31)
/** PIOD_ODSR_P30 Output Data Status **/
#define PIOD_ODSR_P30		(1 << 30)
/** PIOD_ODSR_P29 Output Data Status **/
#define PIOD_ODSR_P29		(1 << 29)
/** PIOD_ODSR_P28 Output Data Status **/
#define PIOD_ODSR_P28		(1 << 28)
/** PIOD_ODSR_P27 Output Data Status **/
#define PIOD_ODSR_P27		(1 << 27)
/** PIOD_ODSR_P26 Output Data Status **/
#define PIOD_ODSR_P26		(1 << 26)
/** PIOD_ODSR_P25 Output Data Status **/
#define PIOD_ODSR_P25		(1 << 25)
/** PIOD_ODSR_P24 Output Data Status **/
#define PIOD_ODSR_P24		(1 << 24)
/** PIOD_ODSR_P23 Output Data Status **/
#define PIOD_ODSR_P23		(1 << 23)
/** PIOD_ODSR_P22 Output Data Status **/
#define PIOD_ODSR_P22		(1 << 22)
/** PIOD_ODSR_P21 Output Data Status **/
#define PIOD_ODSR_P21		(1 << 21)
/** PIOD_ODSR_P20 Output Data Status **/
#define PIOD_ODSR_P20		(1 << 20)
/** PIOD_ODSR_P19 Output Data Status **/
#define PIOD_ODSR_P19		(1 << 19)
/** PIOD_ODSR_P18 Output Data Status **/
#define PIOD_ODSR_P18		(1 << 18)
/** PIOD_ODSR_P17 Output Data Status **/
#define PIOD_ODSR_P17		(1 << 17)
/** PIOD_ODSR_P16 Output Data Status **/
#define PIOD_ODSR_P16		(1 << 16)
/** PIOD_ODSR_P15 Output Data Status **/
#define PIOD_ODSR_P15		(1 << 15)
/** PIOD_ODSR_P14 Output Data Status **/
#define PIOD_ODSR_P14		(1 << 14)
/** PIOD_ODSR_P13 Output Data Status **/
#define PIOD_ODSR_P13		(1 << 13)
/** PIOD_ODSR_P12 Output Data Status **/
#define PIOD_ODSR_P12		(1 << 12)
/** PIOD_ODSR_P11 Output Data Status **/
#define PIOD_ODSR_P11		(1 << 11)
/** PIOD_ODSR_P10 Output Data Status **/
#define PIOD_ODSR_P10		(1 << 10)
/** PIOD_ODSR_P9 Output Data Status **/
#define PIOD_ODSR_P9		(1 << 9)
/** PIOD_ODSR_P8 Output Data Status **/
#define PIOD_ODSR_P8		(1 << 8)
/** PIOD_ODSR_P7 Output Data Status **/
#define PIOD_ODSR_P7		(1 << 7)
/** PIOD_ODSR_P6 Output Data Status **/
#define PIOD_ODSR_P6		(1 << 6)
/** PIOD_ODSR_P5 Output Data Status **/
#define PIOD_ODSR_P5		(1 << 5)
/** PIOD_ODSR_P4 Output Data Status **/
#define PIOD_ODSR_P4		(1 << 4)
/** PIOD_ODSR_P3 Output Data Status **/
#define PIOD_ODSR_P3		(1 << 3)
/** PIOD_ODSR_P2 Output Data Status **/
#define PIOD_ODSR_P2		(1 << 2)
/** PIOD_ODSR_P1 Output Data Status **/
#define PIOD_ODSR_P1		(1 << 1)
/** PIOD_ODSR_P0 Output Data Status **/
#define PIOD_ODSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pdsr PDSR Pin Data Status Register
@{*/

/** PIOD_PDSR_P31 Output Data Status **/
#define PIOD_PDSR_P31		(1 << 31)
/** PIOD_PDSR_P30 Output Data Status **/
#define PIOD_PDSR_P30		(1 << 30)
/** PIOD_PDSR_P29 Output Data Status **/
#define PIOD_PDSR_P29		(1 << 29)
/** PIOD_PDSR_P28 Output Data Status **/
#define PIOD_PDSR_P28		(1 << 28)
/** PIOD_PDSR_P27 Output Data Status **/
#define PIOD_PDSR_P27		(1 << 27)
/** PIOD_PDSR_P26 Output Data Status **/
#define PIOD_PDSR_P26		(1 << 26)
/** PIOD_PDSR_P25 Output Data Status **/
#define PIOD_PDSR_P25		(1 << 25)
/** PIOD_PDSR_P24 Output Data Status **/
#define PIOD_PDSR_P24		(1 << 24)
/** PIOD_PDSR_P23 Output Data Status **/
#define PIOD_PDSR_P23		(1 << 23)
/** PIOD_PDSR_P22 Output Data Status **/
#define PIOD_PDSR_P22		(1 << 22)
/** PIOD_PDSR_P21 Output Data Status **/
#define PIOD_PDSR_P21		(1 << 21)
/** PIOD_PDSR_P20 Output Data Status **/
#define PIOD_PDSR_P20		(1 << 20)
/** PIOD_PDSR_P19 Output Data Status **/
#define PIOD_PDSR_P19		(1 << 19)
/** PIOD_PDSR_P18 Output Data Status **/
#define PIOD_PDSR_P18		(1 << 18)
/** PIOD_PDSR_P17 Output Data Status **/
#define PIOD_PDSR_P17		(1 << 17)
/** PIOD_PDSR_P16 Output Data Status **/
#define PIOD_PDSR_P16		(1 << 16)
/** PIOD_PDSR_P15 Output Data Status **/
#define PIOD_PDSR_P15		(1 << 15)
/** PIOD_PDSR_P14 Output Data Status **/
#define PIOD_PDSR_P14		(1 << 14)
/** PIOD_PDSR_P13 Output Data Status **/
#define PIOD_PDSR_P13		(1 << 13)
/** PIOD_PDSR_P12 Output Data Status **/
#define PIOD_PDSR_P12		(1 << 12)
/** PIOD_PDSR_P11 Output Data Status **/
#define PIOD_PDSR_P11		(1 << 11)
/** PIOD_PDSR_P10 Output Data Status **/
#define PIOD_PDSR_P10		(1 << 10)
/** PIOD_PDSR_P9 Output Data Status **/
#define PIOD_PDSR_P9		(1 << 9)
/** PIOD_PDSR_P8 Output Data Status **/
#define PIOD_PDSR_P8		(1 << 8)
/** PIOD_PDSR_P7 Output Data Status **/
#define PIOD_PDSR_P7		(1 << 7)
/** PIOD_PDSR_P6 Output Data Status **/
#define PIOD_PDSR_P6		(1 << 6)
/** PIOD_PDSR_P5 Output Data Status **/
#define PIOD_PDSR_P5		(1 << 5)
/** PIOD_PDSR_P4 Output Data Status **/
#define PIOD_PDSR_P4		(1 << 4)
/** PIOD_PDSR_P3 Output Data Status **/
#define PIOD_PDSR_P3		(1 << 3)
/** PIOD_PDSR_P2 Output Data Status **/
#define PIOD_PDSR_P2		(1 << 2)
/** PIOD_PDSR_P1 Output Data Status **/
#define PIOD_PDSR_P1		(1 << 1)
/** PIOD_PDSR_P0 Output Data Status **/
#define PIOD_PDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_ier IER Interrupt Enable Register
@{*/

/** PIOD_IER_P31 Input Change Interrupt Enable **/
#define PIOD_IER_P31		(1 << 31)
/** PIOD_IER_P30 Input Change Interrupt Enable **/
#define PIOD_IER_P30		(1 << 30)
/** PIOD_IER_P29 Input Change Interrupt Enable **/
#define PIOD_IER_P29		(1 << 29)
/** PIOD_IER_P28 Input Change Interrupt Enable **/
#define PIOD_IER_P28		(1 << 28)
/** PIOD_IER_P27 Input Change Interrupt Enable **/
#define PIOD_IER_P27		(1 << 27)
/** PIOD_IER_P26 Input Change Interrupt Enable **/
#define PIOD_IER_P26		(1 << 26)
/** PIOD_IER_P25 Input Change Interrupt Enable **/
#define PIOD_IER_P25		(1 << 25)
/** PIOD_IER_P24 Input Change Interrupt Enable **/
#define PIOD_IER_P24		(1 << 24)
/** PIOD_IER_P23 Input Change Interrupt Enable **/
#define PIOD_IER_P23		(1 << 23)
/** PIOD_IER_P22 Input Change Interrupt Enable **/
#define PIOD_IER_P22		(1 << 22)
/** PIOD_IER_P21 Input Change Interrupt Enable **/
#define PIOD_IER_P21		(1 << 21)
/** PIOD_IER_P20 Input Change Interrupt Enable **/
#define PIOD_IER_P20		(1 << 20)
/** PIOD_IER_P19 Input Change Interrupt Enable **/
#define PIOD_IER_P19		(1 << 19)
/** PIOD_IER_P18 Input Change Interrupt Enable **/
#define PIOD_IER_P18		(1 << 18)
/** PIOD_IER_P17 Input Change Interrupt Enable **/
#define PIOD_IER_P17		(1 << 17)
/** PIOD_IER_P16 Input Change Interrupt Enable **/
#define PIOD_IER_P16		(1 << 16)
/** PIOD_IER_P15 Input Change Interrupt Enable **/
#define PIOD_IER_P15		(1 << 15)
/** PIOD_IER_P14 Input Change Interrupt Enable **/
#define PIOD_IER_P14		(1 << 14)
/** PIOD_IER_P13 Input Change Interrupt Enable **/
#define PIOD_IER_P13		(1 << 13)
/** PIOD_IER_P12 Input Change Interrupt Enable **/
#define PIOD_IER_P12		(1 << 12)
/** PIOD_IER_P11 Input Change Interrupt Enable **/
#define PIOD_IER_P11		(1 << 11)
/** PIOD_IER_P10 Input Change Interrupt Enable **/
#define PIOD_IER_P10		(1 << 10)
/** PIOD_IER_P9 Input Change Interrupt Enable **/
#define PIOD_IER_P9		(1 << 9)
/** PIOD_IER_P8 Input Change Interrupt Enable **/
#define PIOD_IER_P8		(1 << 8)
/** PIOD_IER_P7 Input Change Interrupt Enable **/
#define PIOD_IER_P7		(1 << 7)
/** PIOD_IER_P6 Input Change Interrupt Enable **/
#define PIOD_IER_P6		(1 << 6)
/** PIOD_IER_P5 Input Change Interrupt Enable **/
#define PIOD_IER_P5		(1 << 5)
/** PIOD_IER_P4 Input Change Interrupt Enable **/
#define PIOD_IER_P4		(1 << 4)
/** PIOD_IER_P3 Input Change Interrupt Enable **/
#define PIOD_IER_P3		(1 << 3)
/** PIOD_IER_P2 Input Change Interrupt Enable **/
#define PIOD_IER_P2		(1 << 2)
/** PIOD_IER_P1 Input Change Interrupt Enable **/
#define PIOD_IER_P1		(1 << 1)
/** PIOD_IER_P0 Input Change Interrupt Enable **/
#define PIOD_IER_P0		(1 << 0)

/**@}*/

/** @defgroup piod_idr IDR Interrupt Disable Register
@{*/

/** PIOD_IDR_P31 Input Change Interrupt Disable **/
#define PIOD_IDR_P31		(1 << 31)
/** PIOD_IDR_P30 Input Change Interrupt Disable **/
#define PIOD_IDR_P30		(1 << 30)
/** PIOD_IDR_P29 Input Change Interrupt Disable **/
#define PIOD_IDR_P29		(1 << 29)
/** PIOD_IDR_P28 Input Change Interrupt Disable **/
#define PIOD_IDR_P28		(1 << 28)
/** PIOD_IDR_P27 Input Change Interrupt Disable **/
#define PIOD_IDR_P27		(1 << 27)
/** PIOD_IDR_P26 Input Change Interrupt Disable **/
#define PIOD_IDR_P26		(1 << 26)
/** PIOD_IDR_P25 Input Change Interrupt Disable **/
#define PIOD_IDR_P25		(1 << 25)
/** PIOD_IDR_P24 Input Change Interrupt Disable **/
#define PIOD_IDR_P24		(1 << 24)
/** PIOD_IDR_P23 Input Change Interrupt Disable **/
#define PIOD_IDR_P23		(1 << 23)
/** PIOD_IDR_P22 Input Change Interrupt Disable **/
#define PIOD_IDR_P22		(1 << 22)
/** PIOD_IDR_P21 Input Change Interrupt Disable **/
#define PIOD_IDR_P21		(1 << 21)
/** PIOD_IDR_P20 Input Change Interrupt Disable **/
#define PIOD_IDR_P20		(1 << 20)
/** PIOD_IDR_P19 Input Change Interrupt Disable **/
#define PIOD_IDR_P19		(1 << 19)
/** PIOD_IDR_P18 Input Change Interrupt Disable **/
#define PIOD_IDR_P18		(1 << 18)
/** PIOD_IDR_P17 Input Change Interrupt Disable **/
#define PIOD_IDR_P17		(1 << 17)
/** PIOD_IDR_P16 Input Change Interrupt Disable **/
#define PIOD_IDR_P16		(1 << 16)
/** PIOD_IDR_P15 Input Change Interrupt Disable **/
#define PIOD_IDR_P15		(1 << 15)
/** PIOD_IDR_P14 Input Change Interrupt Disable **/
#define PIOD_IDR_P14		(1 << 14)
/** PIOD_IDR_P13 Input Change Interrupt Disable **/
#define PIOD_IDR_P13		(1 << 13)
/** PIOD_IDR_P12 Input Change Interrupt Disable **/
#define PIOD_IDR_P12		(1 << 12)
/** PIOD_IDR_P11 Input Change Interrupt Disable **/
#define PIOD_IDR_P11		(1 << 11)
/** PIOD_IDR_P10 Input Change Interrupt Disable **/
#define PIOD_IDR_P10		(1 << 10)
/** PIOD_IDR_P9 Input Change Interrupt Disable **/
#define PIOD_IDR_P9		(1 << 9)
/** PIOD_IDR_P8 Input Change Interrupt Disable **/
#define PIOD_IDR_P8		(1 << 8)
/** PIOD_IDR_P7 Input Change Interrupt Disable **/
#define PIOD_IDR_P7		(1 << 7)
/** PIOD_IDR_P6 Input Change Interrupt Disable **/
#define PIOD_IDR_P6		(1 << 6)
/** PIOD_IDR_P5 Input Change Interrupt Disable **/
#define PIOD_IDR_P5		(1 << 5)
/** PIOD_IDR_P4 Input Change Interrupt Disable **/
#define PIOD_IDR_P4		(1 << 4)
/** PIOD_IDR_P3 Input Change Interrupt Disable **/
#define PIOD_IDR_P3		(1 << 3)
/** PIOD_IDR_P2 Input Change Interrupt Disable **/
#define PIOD_IDR_P2		(1 << 2)
/** PIOD_IDR_P1 Input Change Interrupt Disable **/
#define PIOD_IDR_P1		(1 << 1)
/** PIOD_IDR_P0 Input Change Interrupt Disable **/
#define PIOD_IDR_P0		(1 << 0)

/**@}*/

