grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** @defgroup piod_imr IMR Interrupt Mask Register
@{*/

/** PIOD_IMR_P31 Input Change Interrupt Mask **/
#define PIOD_IMR_P31		(1 << 31)
/** PIOD_IMR_P30 Input Change Interrupt Mask **/
#define PIOD_IMR_P30		(1 << 30)
/** PIOD_IMR_P29 Input Change Interrupt Mask **/
#define PIOD_IMR_P29		(1 << 29)
/** PIOD_IMR_P28 Input Change Interrupt Mask **/
#define PIOD_IMR_P28		(1 << 28)
/** PIOD_IMR_P27 Input Change Interrupt Mask **/
#define PIOD_IMR_P27		(1 << 27)
/** PIOD_IMR_P26 Input Change Interrupt Mask **/
#define PIOD_IMR_P26		(1 << 26)
/** PIOD_IMR_P25 Input Change Interrupt Mask **/
#define PIOD_IMR_P25		(1 << 25)
/** PIOD_IMR_P24 Input Change Interrupt Mask **/
#define PIOD_IMR_P24		(1 << 24)
/** PIOD_IMR_P23 Input Change Interrupt Mask **/
#define PIOD_IMR_P23		(1 << 23)
/** PIOD_IMR_P22 Input Change Interrupt Mask **/
#define PIOD_IMR_P22		(1 << 22)
/** PIOD_IMR_P21 Input Change Interrupt Mask **/
#define PIOD_IMR_P21		(1 << 21)
/** PIOD_IMR_P20 Input Change Interrupt Mask **/
#define PIOD_IMR_P20		(1 << 20)
/** PIOD_IMR_P19 Input Change Interrupt Mask **/
#define PIOD_IMR_P19		(1 << 19)
/** PIOD_IMR_P18 Input Change Interrupt Mask **/
#define PIOD_IMR_P18		(1 << 18)
/** PIOD_IMR_P17 Input Change Interrupt Mask **/
#define PIOD_IMR_P17		(1 << 17)
/** PIOD_IMR_P16 Input Change Interrupt Mask **/
#define PIOD_IMR_P16		(1 << 16)
/** PIOD_IMR_P15 Input Change Interrupt Mask **/
#define PIOD_IMR_P15		(1 << 15)
/** PIOD_IMR_P14 Input Change Interrupt Mask **/
#define PIOD_IMR_P14		(1 << 14)
/** PIOD_IMR_P13 Input Change Interrupt Mask **/
#define PIOD_IMR_P13		(1 << 13)
/** PIOD_IMR_P12 Input Change Interrupt Mask **/
#define PIOD_IMR_P12		(1 << 12)
/** PIOD_IMR_P11 Input Change Interrupt Mask **/
#define PIOD_IMR_P11		(1 << 11)
/** PIOD_IMR_P10 Input Change Interrupt Mask **/
#define PIOD_IMR_P10		(1 << 10)
/** PIOD_IMR_P9 Input Change Interrupt Mask **/
#define PIOD_IMR_P9		(1 << 9)
/** PIOD_IMR_P8 Input Change Interrupt Mask **/
#define PIOD_IMR_P8		(1 << 8)
/** PIOD_IMR_P7 Input Change Interrupt Mask **/
#define PIOD_IMR_P7		(1 << 7)
/** PIOD_IMR_P6 Input Change Interrupt Mask **/
#define PIOD_IMR_P6		(1 << 6)
/** PIOD_IMR_P5 Input Change Interrupt Mask **/
#define PIOD_IMR_P5		(1 << 5)
/** PIOD_IMR_P4 Input Change Interrupt Mask **/
#define PIOD_IMR_P4		(1 << 4)
/** PIOD_IMR_P3 Input Change Interrupt Mask **/
#define PIOD_IMR_P3		(1 << 3)
/** PIOD_IMR_P2 Input Change Interrupt Mask **/
#define PIOD_IMR_P2		(1 << 2)
/** PIOD_IMR_P1 Input Change Interrupt Mask **/
#define PIOD_IMR_P1		(1 << 1)
/** PIOD_IMR_P0 Input Change Interrupt Mask **/
#define PIOD_IMR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_isr ISR Interrupt Status Register
@{*/

/** PIOD_ISR_P31 Input Change Interrupt Status **/
#define PIOD_ISR_P31		(1 << 31)
/** PIOD_ISR_P30 Input Change Interrupt Status **/
#define PIOD_ISR_P30		(1 << 30)
/** PIOD_ISR_P29 Input Change Interrupt Status **/
#define PIOD_ISR_P29		(1 << 29)
/** PIOD_ISR_P28 Input Change Interrupt Status **/
#define PIOD_ISR_P28		(1 << 28)
/** PIOD_ISR_P27 Input Change Interrupt Status **/
#define PIOD_ISR_P27		(1 << 27)
/** PIOD_ISR_P26 Input Change Interrupt Status **/
#define PIOD_ISR_P26		(1 << 26)
/** PIOD_ISR_P25 Input Change Interrupt Status **/
#define PIOD_ISR_P25		(1 << 25)
/** PIOD_ISR_P24 Input Change Interrupt Status **/
#define PIOD_ISR_P24		(1 << 24)
/** PIOD_ISR_P23 Input Change Interrupt Status **/
#define PIOD_ISR_P23		(1 << 23)
/** PIOD_ISR_P22 Input Change Interrupt Status **/
#define PIOD_ISR_P22		(1 << 22)
/** PIOD_ISR_P21 Input Change Interrupt Status **/
#define PIOD_ISR_P21		(1 << 21)
/** PIOD_ISR_P20 Input Change Interrupt Status **/
#define PIOD_ISR_P20		(1 << 20)
/** PIOD_ISR_P19 Input Change Interrupt Status **/
#define PIOD_ISR_P19		(1 << 19)
/** PIOD_ISR_P18 Input Change Interrupt Status **/
#define PIOD_ISR_P18		(1 << 18)
/** PIOD_ISR_P17 Input Change Interrupt Status **/
#define PIOD_ISR_P17		(1 << 17)
/** PIOD_ISR_P16 Input Change Interrupt Status **/
#define PIOD_ISR_P16		(1 << 16)
/** PIOD_ISR_P15 Input Change Interrupt Status **/
#define PIOD_ISR_P15		(1 << 15)
/** PIOD_ISR_P14 Input Change Interrupt Status **/
#define PIOD_ISR_P14		(1 << 14)
/** PIOD_ISR_P13 Input Change Interrupt Status **/
#define PIOD_ISR_P13		(1 << 13)
/** PIOD_ISR_P12 Input Change Interrupt Status **/
#define PIOD_ISR_P12		(1 << 12)
/** PIOD_ISR_P11 Input Change Interrupt Status **/
#define PIOD_ISR_P11		(1 << 11)
/** PIOD_ISR_P10 Input Change Interrupt Status **/
#define PIOD_ISR_P10		(1 << 10)
/** PIOD_ISR_P9 Input Change Interrupt Status **/
#define PIOD_ISR_P9		(1 << 9)
/** PIOD_ISR_P8 Input Change Interrupt Status **/
#define PIOD_ISR_P8		(1 << 8)
/** PIOD_ISR_P7 Input Change Interrupt Status **/
#define PIOD_ISR_P7		(1 << 7)
/** PIOD_ISR_P6 Input Change Interrupt Status **/
#define PIOD_ISR_P6		(1 << 6)
/** PIOD_ISR_P5 Input Change Interrupt Status **/
#define PIOD_ISR_P5		(1 << 5)
/** PIOD_ISR_P4 Input Change Interrupt Status **/
#define PIOD_ISR_P4		(1 << 4)
/** PIOD_ISR_P3 Input Change Interrupt Status **/
#define PIOD_ISR_P3		(1 << 3)
/** PIOD_ISR_P2 Input Change Interrupt Status **/
#define PIOD_ISR_P2		(1 << 2)
/** PIOD_ISR_P1 Input Change Interrupt Status **/
#define PIOD_ISR_P1		(1 << 1)
/** PIOD_ISR_P0 Input Change Interrupt Status **/
#define PIOD_ISR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_mder MDER Multi-driver Enable Register
@{*/

/** PIOD_MDER_P31 Multi Drive Enable. **/
#define PIOD_MDER_P31		(1 << 31)
/** PIOD_MDER_P30 Multi Drive Enable. **/
#define PIOD_MDER_P30		(1 << 30)
/** PIOD_MDER_P29 Multi Drive Enable. **/
#define PIOD_MDER_P29		(1 << 29)
/** PIOD_MDER_P28 Multi Drive Enable. **/
#define PIOD_MDER_P28		(1 << 28)
/** PIOD_MDER_P27 Multi Drive Enable. **/
#define PIOD_MDER_P27		(1 << 27)
/** PIOD_MDER_P26 Multi Drive Enable. **/
#define PIOD_MDER_P26		(1 << 26)
/** PIOD_MDER_P25 Multi Drive Enable. **/
#define PIOD_MDER_P25		(1 << 25)
/** PIOD_MDER_P24 Multi Drive Enable. **/
#define PIOD_MDER_P24		(1 << 24)
/** PIOD_MDER_P23 Multi Drive Enable. **/
#define PIOD_MDER_P23		(1 << 23)
/** PIOD_MDER_P22 Multi Drive Enable. **/
#define PIOD_MDER_P22		(1 << 22)
/** PIOD_MDER_P21 Multi Drive Enable. **/
#define PIOD_MDER_P21		(1 << 21)
/** PIOD_MDER_P20 Multi Drive Enable. **/
#define PIOD_MDER_P20		(1 << 20)
/** PIOD_MDER_P19 Multi Drive Enable. **/
#define PIOD_MDER_P19		(1 << 19)
/** PIOD_MDER_P18 Multi Drive Enable. **/
#define PIOD_MDER_P18		(1 << 18)
/** PIOD_MDER_P17 Multi Drive Enable. **/
#define PIOD_MDER_P17		(1 << 17)
/** PIOD_MDER_P16 Multi Drive Enable. **/
#define PIOD_MDER_P16		(1 << 16)
/** PIOD_MDER_P15 Multi Drive Enable. **/
#define PIOD_MDER_P15		(1 << 15)
/** PIOD_MDER_P14 Multi Drive Enable. **/
#define PIOD_MDER_P14		(1 << 14)
/** PIOD_MDER_P13 Multi Drive Enable. **/
#define PIOD_MDER_P13		(1 << 13)
/** PIOD_MDER_P12 Multi Drive Enable. **/
#define PIOD_MDER_P12		(1 << 12)
/** PIOD_MDER_P11 Multi Drive Enable. **/
#define PIOD_MDER_P11		(1 << 11)
/** PIOD_MDER_P10 Multi Drive Enable. **/
#define PIOD_MDER_P10		(1 << 10)
/** PIOD_MDER_P9 Multi Drive Enable. **/
#define PIOD_MDER_P9		(1 << 9)
/** PIOD_MDER_P8 Multi Drive Enable. **/
#define PIOD_MDER_P8		(1 << 8)
/** PIOD_MDER_P7 Multi Drive Enable. **/
#define PIOD_MDER_P7		(1 << 7)
/** PIOD_MDER_P6 Multi Drive Enable. **/
#define PIOD_MDER_P6		(1 << 6)
/** PIOD_MDER_P5 Multi Drive Enable. **/
#define PIOD_MDER_P5		(1 << 5)
/** PIOD_MDER_P4 Multi Drive Enable. **/
#define PIOD_MDER_P4		(1 << 4)
/** PIOD_MDER_P3 Multi Drive Enable. **/
#define PIOD_MDER_P3		(1 << 3)
/** PIOD_MDER_P2 Multi Drive Enable. **/
#define PIOD_MDER_P2		(1 << 2)
/** PIOD_MDER_P1 Multi Drive Enable. **/
#define PIOD_MDER_P1		(1 << 1)
/** PIOD_MDER_P0 Multi Drive Enable. **/
#define PIOD_MDER_P0		(1 << 0)

/**@}*/

