grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** @defgroup piod_mddr MDDR Multi-driver Disable Register
@{*/

/** PIOD_MDDR_P31 Multi Drive Disable. **/
#define PIOD_MDDR_P31		(1 << 31)
/** PIOD_MDDR_P30 Multi Drive Disable. **/
#define PIOD_MDDR_P30		(1 << 30)
/** PIOD_MDDR_P29 Multi Drive Disable. **/
#define PIOD_MDDR_P29		(1 << 29)
/** PIOD_MDDR_P28 Multi Drive Disable. **/
#define PIOD_MDDR_P28		(1 << 28)
/** PIOD_MDDR_P27 Multi Drive Disable. **/
#define PIOD_MDDR_P27		(1 << 27)
/** PIOD_MDDR_P26 Multi Drive Disable. **/
#define PIOD_MDDR_P26		(1 << 26)
/** PIOD_MDDR_P25 Multi Drive Disable. **/
#define PIOD_MDDR_P25		(1 << 25)
/** PIOD_MDDR_P24 Multi Drive Disable. **/
#define PIOD_MDDR_P24		(1 << 24)
/** PIOD_MDDR_P23 Multi Drive Disable. **/
#define PIOD_MDDR_P23		(1 << 23)
/** PIOD_MDDR_P22 Multi Drive Disable. **/
#define PIOD_MDDR_P22		(1 << 22)
/** PIOD_MDDR_P21 Multi Drive Disable. **/
#define PIOD_MDDR_P21		(1 << 21)
/** PIOD_MDDR_P20 Multi Drive Disable. **/
#define PIOD_MDDR_P20		(1 << 20)
/** PIOD_MDDR_P19 Multi Drive Disable. **/
#define PIOD_MDDR_P19		(1 << 19)
/** PIOD_MDDR_P18 Multi Drive Disable. **/
#define PIOD_MDDR_P18		(1 << 18)
/** PIOD_MDDR_P17 Multi Drive Disable. **/
#define PIOD_MDDR_P17		(1 << 17)
/** PIOD_MDDR_P16 Multi Drive Disable. **/
#define PIOD_MDDR_P16		(1 << 16)
/** PIOD_MDDR_P15 Multi Drive Disable. **/
#define PIOD_MDDR_P15		(1 << 15)
/** PIOD_MDDR_P14 Multi Drive Disable. **/
#define PIOD_MDDR_P14		(1 << 14)
/** PIOD_MDDR_P13 Multi Drive Disable. **/
#define PIOD_MDDR_P13		(1 << 13)
/** PIOD_MDDR_P12 Multi Drive Disable. **/
#define PIOD_MDDR_P12		(1 << 12)
/** PIOD_MDDR_P11 Multi Drive Disable. **/
#define PIOD_MDDR_P11		(1 << 11)
/** PIOD_MDDR_P10 Multi Drive Disable. **/
#define PIOD_MDDR_P10		(1 << 10)
/** PIOD_MDDR_P9 Multi Drive Disable. **/
#define PIOD_MDDR_P9		(1 << 9)
/** PIOD_MDDR_P8 Multi Drive Disable. **/
#define PIOD_MDDR_P8		(1 << 8)
/** PIOD_MDDR_P7 Multi Drive Disable. **/
#define PIOD_MDDR_P7		(1 << 7)
/** PIOD_MDDR_P6 Multi Drive Disable. **/
#define PIOD_MDDR_P6		(1 << 6)
/** PIOD_MDDR_P5 Multi Drive Disable. **/
#define PIOD_MDDR_P5		(1 << 5)
/** PIOD_MDDR_P4 Multi Drive Disable. **/
#define PIOD_MDDR_P4		(1 << 4)
/** PIOD_MDDR_P3 Multi Drive Disable. **/
#define PIOD_MDDR_P3		(1 << 3)
/** PIOD_MDDR_P2 Multi Drive Disable. **/
#define PIOD_MDDR_P2		(1 << 2)
/** PIOD_MDDR_P1 Multi Drive Disable. **/
#define PIOD_MDDR_P1		(1 << 1)
/** PIOD_MDDR_P0 Multi Drive Disable. **/
#define PIOD_MDDR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_mdsr MDSR Multi-driver Status Register
@{*/

/** PIOD_MDSR_P31 Multi Drive Status. **/
#define PIOD_MDSR_P31		(1 << 31)
/** PIOD_MDSR_P30 Multi Drive Status. **/
#define PIOD_MDSR_P30		(1 << 30)
/** PIOD_MDSR_P29 Multi Drive Status. **/
#define PIOD_MDSR_P29		(1 << 29)
/** PIOD_MDSR_P28 Multi Drive Status. **/
#define PIOD_MDSR_P28		(1 << 28)
/** PIOD_MDSR_P27 Multi Drive Status. **/
#define PIOD_MDSR_P27		(1 << 27)
/** PIOD_MDSR_P26 Multi Drive Status. **/
#define PIOD_MDSR_P26		(1 << 26)
/** PIOD_MDSR_P25 Multi Drive Status. **/
#define PIOD_MDSR_P25		(1 << 25)
/** PIOD_MDSR_P24 Multi Drive Status. **/
#define PIOD_MDSR_P24		(1 << 24)
/** PIOD_MDSR_P23 Multi Drive Status. **/
#define PIOD_MDSR_P23		(1 << 23)
/** PIOD_MDSR_P22 Multi Drive Status. **/
#define PIOD_MDSR_P22		(1 << 22)
/** PIOD_MDSR_P21 Multi Drive Status. **/
#define PIOD_MDSR_P21		(1 << 21)
/** PIOD_MDSR_P20 Multi Drive Status. **/
#define PIOD_MDSR_P20		(1 << 20)
/** PIOD_MDSR_P19 Multi Drive Status. **/
#define PIOD_MDSR_P19		(1 << 19)
/** PIOD_MDSR_P18 Multi Drive Status. **/
#define PIOD_MDSR_P18		(1 << 18)
/** PIOD_MDSR_P17 Multi Drive Status. **/
#define PIOD_MDSR_P17		(1 << 17)
/** PIOD_MDSR_P16 Multi Drive Status. **/
#define PIOD_MDSR_P16		(1 << 16)
/** PIOD_MDSR_P15 Multi Drive Status. **/
#define PIOD_MDSR_P15		(1 << 15)
/** PIOD_MDSR_P14 Multi Drive Status. **/
#define PIOD_MDSR_P14		(1 << 14)
/** PIOD_MDSR_P13 Multi Drive Status. **/
#define PIOD_MDSR_P13		(1 << 13)
/** PIOD_MDSR_P12 Multi Drive Status. **/
#define PIOD_MDSR_P12		(1 << 12)
/** PIOD_MDSR_P11 Multi Drive Status. **/
#define PIOD_MDSR_P11		(1 << 11)
/** PIOD_MDSR_P10 Multi Drive Status. **/
#define PIOD_MDSR_P10		(1 << 10)
/** PIOD_MDSR_P9 Multi Drive Status. **/
#define PIOD_MDSR_P9		(1 << 9)
/** PIOD_MDSR_P8 Multi Drive Status. **/
#define PIOD_MDSR_P8		(1 << 8)
/** PIOD_MDSR_P7 Multi Drive Status. **/
#define PIOD_MDSR_P7		(1 << 7)
/** PIOD_MDSR_P6 Multi Drive Status. **/
#define PIOD_MDSR_P6		(1 << 6)
/** PIOD_MDSR_P5 Multi Drive Status. **/
#define PIOD_MDSR_P5		(1 << 5)
/** PIOD_MDSR_P4 Multi Drive Status. **/
#define PIOD_MDSR_P4		(1 << 4)
/** PIOD_MDSR_P3 Multi Drive Status. **/
#define PIOD_MDSR_P3		(1 << 3)
/** PIOD_MDSR_P2 Multi Drive Status. **/
#define PIOD_MDSR_P2		(1 << 2)
/** PIOD_MDSR_P1 Multi Drive Status. **/
#define PIOD_MDSR_P1		(1 << 1)
/** PIOD_MDSR_P0 Multi Drive Status. **/
#define PIOD_MDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pudr PUDR Pull-up Disable Register
@{*/

/** PIOD_PUDR_P31 Pull Up Disable. **/
#define PIOD_PUDR_P31		(1 << 31)
/** PIOD_PUDR_P30 Pull Up Disable. **/
#define PIOD_PUDR_P30		(1 << 30)
/** PIOD_PUDR_P29 Pull Up Disable. **/
#define PIOD_PUDR_P29		(1 << 29)
/** PIOD_PUDR_P28 Pull Up Disable. **/
#define PIOD_PUDR_P28		(1 << 28)
/** PIOD_PUDR_P27 Pull Up Disable. **/
#define PIOD_PUDR_P27		(1 << 27)
/** PIOD_PUDR_P26 Pull Up Disable. **/
#define PIOD_PUDR_P26		(1 << 26)
/** PIOD_PUDR_P25 Pull Up Disable. **/
#define PIOD_PUDR_P25		(1 << 25)
/** PIOD_PUDR_P24 Pull Up Disable. **/
#define PIOD_PUDR_P24		(1 << 24)
/** PIOD_PUDR_P23 Pull Up Disable. **/
#define PIOD_PUDR_P23		(1 << 23)
/** PIOD_PUDR_P22 Pull Up Disable. **/
#define PIOD_PUDR_P22		(1 << 22)
/** PIOD_PUDR_P21 Pull Up Disable. **/
#define PIOD_PUDR_P21		(1 << 21)
/** PIOD_PUDR_P20 Pull Up Disable. **/
#define PIOD_PUDR_P20		(1 << 20)
/** PIOD_PUDR_P19 Pull Up Disable. **/
#define PIOD_PUDR_P19		(1 << 19)
/** PIOD_PUDR_P18 Pull Up Disable. **/
#define PIOD_PUDR_P18		(1 << 18)
/** PIOD_PUDR_P17 Pull Up Disable. **/
#define PIOD_PUDR_P17		(1 << 17)
/** PIOD_PUDR_P16 Pull Up Disable. **/
#define PIOD_PUDR_P16		(1 << 16)
/** PIOD_PUDR_P15 Pull Up Disable. **/
#define PIOD_PUDR_P15		(1 << 15)
/** PIOD_PUDR_P14 Pull Up Disable. **/
#define PIOD_PUDR_P14		(1 << 14)
/** PIOD_PUDR_P13 Pull Up Disable. **/
#define PIOD_PUDR_P13		(1 << 13)
/** PIOD_PUDR_P12 Pull Up Disable. **/
#define PIOD_PUDR_P12		(1 << 12)
/** PIOD_PUDR_P11 Pull Up Disable. **/
#define PIOD_PUDR_P11		(1 << 11)
/** PIOD_PUDR_P10 Pull Up Disable. **/
#define PIOD_PUDR_P10		(1 << 10)
/** PIOD_PUDR_P9 Pull Up Disable. **/
#define PIOD_PUDR_P9		(1 << 9)
/** PIOD_PUDR_P8 Pull Up Disable. **/
#define PIOD_PUDR_P8		(1 << 8)
/** PIOD_PUDR_P7 Pull Up Disable. **/
#define PIOD_PUDR_P7		(1 << 7)
/** PIOD_PUDR_P6 Pull Up Disable. **/
#define PIOD_PUDR_P6		(1 << 6)
/** PIOD_PUDR_P5 Pull Up Disable. **/
#define PIOD_PUDR_P5		(1 << 5)
/** PIOD_PUDR_P4 Pull Up Disable. **/
#define PIOD_PUDR_P4		(1 << 4)
/** PIOD_PUDR_P3 Pull Up Disable. **/
#define PIOD_PUDR_P3		(1 << 3)
/** PIOD_PUDR_P2 Pull Up Disable. **/
#define PIOD_PUDR_P2		(1 << 2)
/** PIOD_PUDR_P1 Pull Up Disable. **/
#define PIOD_PUDR_P1		(1 << 1)
/** PIOD_PUDR_P0 Pull Up Disable. **/
#define PIOD_PUDR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_puer PUER Pull-up Enable Register
@{*/

/** PIOD_PUER_P31 Pull Up Enable. **/
#define PIOD_PUER_P31		(1 << 31)
/** PIOD_PUER_P30 Pull Up Enable. **/
#define PIOD_PUER_P30		(1 << 30)
/** PIOD_PUER_P29 Pull Up Enable. **/
#define PIOD_PUER_P29		(1 << 29)
/** PIOD_PUER_P28 Pull Up Enable. **/
#define PIOD_PUER_P28		(1 << 28)
/** PIOD_PUER_P27 Pull Up Enable. **/
#define PIOD_PUER_P27		(1 << 27)
/** PIOD_PUER_P26 Pull Up Enable. **/
#define PIOD_PUER_P26		(1 << 26)
/** PIOD_PUER_P25 Pull Up Enable. **/
#define PIOD_PUER_P25		(1 << 25)
/** PIOD_PUER_P24 Pull Up Enable. **/
#define PIOD_PUER_P24		(1 << 24)
/** PIOD_PUER_P23 Pull Up Enable. **/
#define PIOD_PUER_P23		(1 << 23)
/** PIOD_PUER_P22 Pull Up Enable. **/
#define PIOD_PUER_P22		(1 << 22)
/** PIOD_PUER_P21 Pull Up Enable. **/
#define PIOD_PUER_P21		(1 << 21)
/** PIOD_PUER_P20 Pull Up Enable. **/
#define PIOD_PUER_P20		(1 << 20)
/** PIOD_PUER_P19 Pull Up Enable. **/
#define PIOD_PUER_P19		(1 << 19)
/** PIOD_PUER_P18 Pull Up Enable. **/
#define PIOD_PUER_P18		(1 << 18)
/** PIOD_PUER_P17 Pull Up Enable. **/
#define PIOD_PUER_P17		(1 << 17)
/** PIOD_PUER_P16 Pull Up Enable. **/
#define PIOD_PUER_P16		(1 << 16)
/** PIOD_PUER_P15 Pull Up Enable. **/
#define PIOD_PUER_P15		(1 << 15)
/** PIOD_PUER_P14 Pull Up Enable. **/
#define PIOD_PUER_P14		(1 << 14)
/** PIOD_PUER_P13 Pull Up Enable. **/
#define PIOD_PUER_P13		(1 << 13)
/** PIOD_PUER_P12 Pull Up Enable. **/
#define PIOD_PUER_P12		(1 << 12)
/** PIOD_PUER_P11 Pull Up Enable. **/
#define PIOD_PUER_P11		(1 << 11)
/** PIOD_PUER_P10 Pull Up Enable. **/
#define PIOD_PUER_P10		(1 << 10)
/** PIOD_PUER_P9 Pull Up Enable. **/
#define PIOD_PUER_P9		(1 << 9)
/** PIOD_PUER_P8 Pull Up Enable. **/
#define PIOD_PUER_P8		(1 << 8)
/** PIOD_PUER_P7 Pull Up Enable. **/
#define PIOD_PUER_P7		(1 << 7)
/** PIOD_PUER_P6 Pull Up Enable. **/
#define PIOD_PUER_P6		(1 << 6)
/** PIOD_PUER_P5 Pull Up Enable. **/
#define PIOD_PUER_P5		(1 << 5)
/** PIOD_PUER_P4 Pull Up Enable. **/
#define PIOD_PUER_P4		(1 << 4)
/** PIOD_PUER_P3 Pull Up Enable. **/
#define PIOD_PUER_P3		(1 << 3)
/** PIOD_PUER_P2 Pull Up Enable. **/
#define PIOD_PUER_P2		(1 << 2)
/** PIOD_PUER_P1 Pull Up Enable. **/
#define PIOD_PUER_P1		(1 << 1)
/** PIOD_PUER_P0 Pull Up Enable. **/
#define PIOD_PUER_P0		(1 << 0)

/**@}*/

