grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** @defgroup piod_pusr PUSR Pad Pull-up Status Register
@{*/

/** PIOD_PUSR_P31 Pull Up Status. **/
#define PIOD_PUSR_P31		(1 << 31)
/** PIOD_PUSR_P30 Pull Up Status. **/
#define PIOD_PUSR_P30		(1 << 30)
/** PIOD_PUSR_P29 Pull Up Status. **/
#define PIOD_PUSR_P29		(1 << 29)
/** PIOD_PUSR_P28 Pull Up Status. **/
#define PIOD_PUSR_P28		(1 << 28)
/** PIOD_PUSR_P27 Pull Up Status. **/
#define PIOD_PUSR_P27		(1 << 27)
/** PIOD_PUSR_P26 Pull Up Status. **/
#define PIOD_PUSR_P26		(1 << 26)
/** PIOD_PUSR_P25 Pull Up Status. **/
#define PIOD_PUSR_P25		(1 << 25)
/** PIOD_PUSR_P24 Pull Up Status. **/
#define PIOD_PUSR_P24		(1 << 24)
/** PIOD_PUSR_P23 Pull Up Status. **/
#define PIOD_PUSR_P23		(1 << 23)
/** PIOD_PUSR_P22 Pull Up Status. **/
#define PIOD_PUSR_P22		(1 << 22)
/** PIOD_PUSR_P21 Pull Up Status. **/
#define PIOD_PUSR_P21		(1 << 21)
/** PIOD_PUSR_P20 Pull Up Status. **/
#define PIOD_PUSR_P20		(1 << 20)
/** PIOD_PUSR_P19 Pull Up Status. **/
#define PIOD_PUSR_P19		(1 << 19)
/** PIOD_PUSR_P18 Pull Up Status. **/
#define PIOD_PUSR_P18		(1 << 18)
/** PIOD_PUSR_P17 Pull Up Status. **/
#define PIOD_PUSR_P17		(1 << 17)
/** PIOD_PUSR_P16 Pull Up Status. **/
#define PIOD_PUSR_P16		(1 << 16)
/** PIOD_PUSR_P15 Pull Up Status. **/
#define PIOD_PUSR_P15		(1 << 15)
/** PIOD_PUSR_P14 Pull Up Status. **/
#define PIOD_PUSR_P14		(1 << 14)
/** PIOD_PUSR_P13 Pull Up Status. **/
#define PIOD_PUSR_P13		(1 << 13)
/** PIOD_PUSR_P12 Pull Up Status. **/
#define PIOD_PUSR_P12		(1 << 12)
/** PIOD_PUSR_P11 Pull Up Status. **/
#define PIOD_PUSR_P11		(1 << 11)
/** PIOD_PUSR_P10 Pull Up Status. **/
#define PIOD_PUSR_P10		(1 << 10)
/** PIOD_PUSR_P9 Pull Up Status. **/
#define PIOD_PUSR_P9		(1 << 9)
/** PIOD_PUSR_P8 Pull Up Status. **/
#define PIOD_PUSR_P8		(1 << 8)
/** PIOD_PUSR_P7 Pull Up Status. **/
#define PIOD_PUSR_P7		(1 << 7)
/** PIOD_PUSR_P6 Pull Up Status. **/
#define PIOD_PUSR_P6		(1 << 6)
/** PIOD_PUSR_P5 Pull Up Status. **/
#define PIOD_PUSR_P5		(1 << 5)
/** PIOD_PUSR_P4 Pull Up Status. **/
#define PIOD_PUSR_P4		(1 << 4)
/** PIOD_PUSR_P3 Pull Up Status. **/
#define PIOD_PUSR_P3		(1 << 3)
/** PIOD_PUSR_P2 Pull Up Status. **/
#define PIOD_PUSR_P2		(1 << 2)
/** PIOD_PUSR_P1 Pull Up Status. **/
#define PIOD_PUSR_P1		(1 << 1)
/** PIOD_PUSR_P0 Pull Up Status. **/
#define PIOD_PUSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_absr ABSR Peripheral AB Select Register
@{*/

/** PIOD_ABSR_P31 Peripheral A Select. **/
#define PIOD_ABSR_P31		(1 << 31)
/** PIOD_ABSR_P30 Peripheral A Select. **/
#define PIOD_ABSR_P30		(1 << 30)
/** PIOD_ABSR_P29 Peripheral A Select. **/
#define PIOD_ABSR_P29		(1 << 29)
/** PIOD_ABSR_P28 Peripheral A Select. **/
#define PIOD_ABSR_P28		(1 << 28)
/** PIOD_ABSR_P27 Peripheral A Select. **/
#define PIOD_ABSR_P27		(1 << 27)
/** PIOD_ABSR_P26 Peripheral A Select. **/
#define PIOD_ABSR_P26		(1 << 26)
/** PIOD_ABSR_P25 Peripheral A Select. **/
#define PIOD_ABSR_P25		(1 << 25)
/** PIOD_ABSR_P24 Peripheral A Select. **/
#define PIOD_ABSR_P24		(1 << 24)
/** PIOD_ABSR_P23 Peripheral A Select. **/
#define PIOD_ABSR_P23		(1 << 23)
/** PIOD_ABSR_P22 Peripheral A Select. **/
#define PIOD_ABSR_P22		(1 << 22)
/** PIOD_ABSR_P21 Peripheral A Select. **/
#define PIOD_ABSR_P21		(1 << 21)
/** PIOD_ABSR_P20 Peripheral A Select. **/
#define PIOD_ABSR_P20		(1 << 20)
/** PIOD_ABSR_P19 Peripheral A Select. **/
#define PIOD_ABSR_P19		(1 << 19)
/** PIOD_ABSR_P18 Peripheral A Select. **/
#define PIOD_ABSR_P18		(1 << 18)
/** PIOD_ABSR_P17 Peripheral A Select. **/
#define PIOD_ABSR_P17		(1 << 17)
/** PIOD_ABSR_P16 Peripheral A Select. **/
#define PIOD_ABSR_P16		(1 << 16)
/** PIOD_ABSR_P15 Peripheral A Select. **/
#define PIOD_ABSR_P15		(1 << 15)
/** PIOD_ABSR_P14 Peripheral A Select. **/
#define PIOD_ABSR_P14		(1 << 14)
/** PIOD_ABSR_P13 Peripheral A Select. **/
#define PIOD_ABSR_P13		(1 << 13)
/** PIOD_ABSR_P12 Peripheral A Select. **/
#define PIOD_ABSR_P12		(1 << 12)
/** PIOD_ABSR_P11 Peripheral A Select. **/
#define PIOD_ABSR_P11		(1 << 11)
/** PIOD_ABSR_P10 Peripheral A Select. **/
#define PIOD_ABSR_P10		(1 << 10)
/** PIOD_ABSR_P9 Peripheral A Select. **/
#define PIOD_ABSR_P9		(1 << 9)
/** PIOD_ABSR_P8 Peripheral A Select. **/
#define PIOD_ABSR_P8		(1 << 8)
/** PIOD_ABSR_P7 Peripheral A Select. **/
#define PIOD_ABSR_P7		(1 << 7)
/** PIOD_ABSR_P6 Peripheral A Select. **/
#define PIOD_ABSR_P6		(1 << 6)
/** PIOD_ABSR_P5 Peripheral A Select. **/
#define PIOD_ABSR_P5		(1 << 5)
/** PIOD_ABSR_P4 Peripheral A Select. **/
#define PIOD_ABSR_P4		(1 << 4)
/** PIOD_ABSR_P3 Peripheral A Select. **/
#define PIOD_ABSR_P3		(1 << 3)
/** PIOD_ABSR_P2 Peripheral A Select. **/
#define PIOD_ABSR_P2		(1 << 2)
/** PIOD_ABSR_P1 Peripheral A Select. **/
#define PIOD_ABSR_P1		(1 << 1)
/** PIOD_ABSR_P0 Peripheral A Select. **/
#define PIOD_ABSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_scifsr SCIFSR System Clock Glitch Input Filter Select Register
@{*/

/** PIOD_SCIFSR_P31 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P31		(1 << 31)
/** PIOD_SCIFSR_P30 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P30		(1 << 30)
/** PIOD_SCIFSR_P29 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P29		(1 << 29)
/** PIOD_SCIFSR_P28 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P28		(1 << 28)
/** PIOD_SCIFSR_P27 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P27		(1 << 27)
/** PIOD_SCIFSR_P26 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P26		(1 << 26)
/** PIOD_SCIFSR_P25 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P25		(1 << 25)
/** PIOD_SCIFSR_P24 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P24		(1 << 24)
/** PIOD_SCIFSR_P23 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P23		(1 << 23)
/** PIOD_SCIFSR_P22 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P22		(1 << 22)
/** PIOD_SCIFSR_P21 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P21		(1 << 21)
/** PIOD_SCIFSR_P20 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P20		(1 << 20)
/** PIOD_SCIFSR_P19 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P19		(1 << 19)
/** PIOD_SCIFSR_P18 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P18		(1 << 18)
/** PIOD_SCIFSR_P17 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P17		(1 << 17)
/** PIOD_SCIFSR_P16 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P16		(1 << 16)
/** PIOD_SCIFSR_P15 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P15		(1 << 15)
/** PIOD_SCIFSR_P14 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P14		(1 << 14)
/** PIOD_SCIFSR_P13 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P13		(1 << 13)
/** PIOD_SCIFSR_P12 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P12		(1 << 12)
/** PIOD_SCIFSR_P11 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P11		(1 << 11)
/** PIOD_SCIFSR_P10 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P10		(1 << 10)
/** PIOD_SCIFSR_P9 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P9		(1 << 9)
/** PIOD_SCIFSR_P8 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P8		(1 << 8)
/** PIOD_SCIFSR_P7 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P7		(1 << 7)
/** PIOD_SCIFSR_P6 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P6		(1 << 6)
/** PIOD_SCIFSR_P5 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P5		(1 << 5)
/** PIOD_SCIFSR_P4 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P4		(1 << 4)
/** PIOD_SCIFSR_P3 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P3		(1 << 3)
/** PIOD_SCIFSR_P2 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P2		(1 << 2)
/** PIOD_SCIFSR_P1 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P1		(1 << 1)
/** PIOD_SCIFSR_P0 System Clock Glitch Filtering Select. **/
#define PIOD_SCIFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_difsr DIFSR Debouncing Input Filter Select Register
@{*/

