grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** PIOD_DIFSR_P31 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P31		(1 << 31)
/** PIOD_DIFSR_P30 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P30		(1 << 30)
/** PIOD_DIFSR_P29 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P29		(1 << 29)
/** PIOD_DIFSR_P28 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P28		(1 << 28)
/** PIOD_DIFSR_P27 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P27		(1 << 27)
/** PIOD_DIFSR_P26 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P26		(1 << 26)
/** PIOD_DIFSR_P25 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P25		(1 << 25)
/** PIOD_DIFSR_P24 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P24		(1 << 24)
/** PIOD_DIFSR_P23 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P23		(1 << 23)
/** PIOD_DIFSR_P22 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P22		(1 << 22)
/** PIOD_DIFSR_P21 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P21		(1 << 21)
/** PIOD_DIFSR_P20 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P20		(1 << 20)
/** PIOD_DIFSR_P19 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P19		(1 << 19)
/** PIOD_DIFSR_P18 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P18		(1 << 18)
/** PIOD_DIFSR_P17 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P17		(1 << 17)
/** PIOD_DIFSR_P16 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P16		(1 << 16)
/** PIOD_DIFSR_P15 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P15		(1 << 15)
/** PIOD_DIFSR_P14 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P14		(1 << 14)
/** PIOD_DIFSR_P13 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P13		(1 << 13)
/** PIOD_DIFSR_P12 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P12		(1 << 12)
/** PIOD_DIFSR_P11 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P11		(1 << 11)
/** PIOD_DIFSR_P10 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P10		(1 << 10)
/** PIOD_DIFSR_P9 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P9		(1 << 9)
/** PIOD_DIFSR_P8 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P8		(1 << 8)
/** PIOD_DIFSR_P7 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P7		(1 << 7)
/** PIOD_DIFSR_P6 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P6		(1 << 6)
/** PIOD_DIFSR_P5 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P5		(1 << 5)
/** PIOD_DIFSR_P4 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P4		(1 << 4)
/** PIOD_DIFSR_P3 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P3		(1 << 3)
/** PIOD_DIFSR_P2 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P2		(1 << 2)
/** PIOD_DIFSR_P1 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P1		(1 << 1)
/** PIOD_DIFSR_P0 Debouncing Filtering Select. **/
#define PIOD_DIFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_ifdgsr IFDGSR Glitch or Debouncing Input Filter Clock Selection Status Register
@{*/

/** PIOD_IFDGSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P31		(1 << 31)
/** PIOD_IFDGSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P30		(1 << 30)
/** PIOD_IFDGSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P29		(1 << 29)
/** PIOD_IFDGSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P28		(1 << 28)
/** PIOD_IFDGSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P27		(1 << 27)
/** PIOD_IFDGSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P26		(1 << 26)
/** PIOD_IFDGSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P25		(1 << 25)
/** PIOD_IFDGSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P24		(1 << 24)
/** PIOD_IFDGSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P23		(1 << 23)
/** PIOD_IFDGSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P22		(1 << 22)
/** PIOD_IFDGSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P21		(1 << 21)
/** PIOD_IFDGSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P20		(1 << 20)
/** PIOD_IFDGSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P19		(1 << 19)
/** PIOD_IFDGSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P18		(1 << 18)
/** PIOD_IFDGSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P17		(1 << 17)
/** PIOD_IFDGSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P16		(1 << 16)
/** PIOD_IFDGSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P15		(1 << 15)
/** PIOD_IFDGSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P14		(1 << 14)
/** PIOD_IFDGSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P13		(1 << 13)
/** PIOD_IFDGSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P12		(1 << 12)
/** PIOD_IFDGSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P11		(1 << 11)
/** PIOD_IFDGSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P10		(1 << 10)
/** PIOD_IFDGSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P9		(1 << 9)
/** PIOD_IFDGSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P8		(1 << 8)
/** PIOD_IFDGSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P7		(1 << 7)
/** PIOD_IFDGSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P6		(1 << 6)
/** PIOD_IFDGSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P5		(1 << 5)
/** PIOD_IFDGSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P4		(1 << 4)
/** PIOD_IFDGSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P3		(1 << 3)
/** PIOD_IFDGSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P2		(1 << 2)
/** PIOD_IFDGSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P1		(1 << 1)
/** PIOD_IFDGSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOD_IFDGSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOD_SCDR_DIV_SHIFT		0
#define PIOD_SCDR_DIV_MASK		0x3fff
/** @defgroup piod_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

/** @defgroup piod_ower OWER Output Write Enable
@{*/

/** PIOD_OWER_P31 Output Write Enable. **/
#define PIOD_OWER_P31		(1 << 31)
/** PIOD_OWER_P30 Output Write Enable. **/
#define PIOD_OWER_P30		(1 << 30)
/** PIOD_OWER_P29 Output Write Enable. **/
#define PIOD_OWER_P29		(1 << 29)
/** PIOD_OWER_P28 Output Write Enable. **/
#define PIOD_OWER_P28		(1 << 28)
/** PIOD_OWER_P27 Output Write Enable. **/
#define PIOD_OWER_P27		(1 << 27)
/** PIOD_OWER_P26 Output Write Enable. **/
#define PIOD_OWER_P26		(1 << 26)
/** PIOD_OWER_P25 Output Write Enable. **/
#define PIOD_OWER_P25		(1 << 25)
/** PIOD_OWER_P24 Output Write Enable. **/
#define PIOD_OWER_P24		(1 << 24)
/** PIOD_OWER_P23 Output Write Enable. **/
#define PIOD_OWER_P23		(1 << 23)
/** PIOD_OWER_P22 Output Write Enable. **/
#define PIOD_OWER_P22		(1 << 22)
/** PIOD_OWER_P21 Output Write Enable. **/
#define PIOD_OWER_P21		(1 << 21)
/** PIOD_OWER_P20 Output Write Enable. **/
#define PIOD_OWER_P20		(1 << 20)
/** PIOD_OWER_P19 Output Write Enable. **/
#define PIOD_OWER_P19		(1 << 19)
/** PIOD_OWER_P18 Output Write Enable. **/
#define PIOD_OWER_P18		(1 << 18)
/** PIOD_OWER_P17 Output Write Enable. **/
#define PIOD_OWER_P17		(1 << 17)
/** PIOD_OWER_P16 Output Write Enable. **/
#define PIOD_OWER_P16		(1 << 16)
/** PIOD_OWER_P15 Output Write Enable. **/
#define PIOD_OWER_P15		(1 << 15)
/** PIOD_OWER_P14 Output Write Enable. **/
#define PIOD_OWER_P14		(1 << 14)
/** PIOD_OWER_P13 Output Write Enable. **/
#define PIOD_OWER_P13		(1 << 13)
/** PIOD_OWER_P12 Output Write Enable. **/
#define PIOD_OWER_P12		(1 << 12)
/** PIOD_OWER_P11 Output Write Enable. **/
#define PIOD_OWER_P11		(1 << 11)
/** PIOD_OWER_P10 Output Write Enable. **/
#define PIOD_OWER_P10		(1 << 10)
/** PIOD_OWER_P9 Output Write Enable. **/
#define PIOD_OWER_P9		(1 << 9)
/** PIOD_OWER_P8 Output Write Enable. **/
#define PIOD_OWER_P8		(1 << 8)
/** PIOD_OWER_P7 Output Write Enable. **/
#define PIOD_OWER_P7		(1 << 7)
/** PIOD_OWER_P6 Output Write Enable. **/
#define PIOD_OWER_P6		(1 << 6)
/** PIOD_OWER_P5 Output Write Enable. **/
#define PIOD_OWER_P5		(1 << 5)
/** PIOD_OWER_P4 Output Write Enable. **/
#define PIOD_OWER_P4		(1 << 4)
/** PIOD_OWER_P3 Output Write Enable. **/
#define PIOD_OWER_P3		(1 << 3)
/** PIOD_OWER_P2 Output Write Enable. **/
#define PIOD_OWER_P2		(1 << 2)
/** PIOD_OWER_P1 Output Write Enable. **/
#define PIOD_OWER_P1		(1 << 1)
/** PIOD_OWER_P0 Output Write Enable. **/
#define PIOD_OWER_P0		(1 << 0)

/**@}*/

