grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** PIOD_AIMMR_P31 Peripheral CD Status. **/
#define PIOD_AIMMR_P31		(1 << 31)
/** PIOD_AIMMR_P30 Peripheral CD Status. **/
#define PIOD_AIMMR_P30		(1 << 30)
/** PIOD_AIMMR_P29 Peripheral CD Status. **/
#define PIOD_AIMMR_P29		(1 << 29)
/** PIOD_AIMMR_P28 Peripheral CD Status. **/
#define PIOD_AIMMR_P28		(1 << 28)
/** PIOD_AIMMR_P27 Peripheral CD Status. **/
#define PIOD_AIMMR_P27		(1 << 27)
/** PIOD_AIMMR_P26 Peripheral CD Status. **/
#define PIOD_AIMMR_P26		(1 << 26)
/** PIOD_AIMMR_P25 Peripheral CD Status. **/
#define PIOD_AIMMR_P25		(1 << 25)
/** PIOD_AIMMR_P24 Peripheral CD Status. **/
#define PIOD_AIMMR_P24		(1 << 24)
/** PIOD_AIMMR_P23 Peripheral CD Status. **/
#define PIOD_AIMMR_P23		(1 << 23)
/** PIOD_AIMMR_P22 Peripheral CD Status. **/
#define PIOD_AIMMR_P22		(1 << 22)
/** PIOD_AIMMR_P21 Peripheral CD Status. **/
#define PIOD_AIMMR_P21		(1 << 21)
/** PIOD_AIMMR_P20 Peripheral CD Status. **/
#define PIOD_AIMMR_P20		(1 << 20)
/** PIOD_AIMMR_P19 Peripheral CD Status. **/
#define PIOD_AIMMR_P19		(1 << 19)
/** PIOD_AIMMR_P18 Peripheral CD Status. **/
#define PIOD_AIMMR_P18		(1 << 18)
/** PIOD_AIMMR_P17 Peripheral CD Status. **/
#define PIOD_AIMMR_P17		(1 << 17)
/** PIOD_AIMMR_P16 Peripheral CD Status. **/
#define PIOD_AIMMR_P16		(1 << 16)
/** PIOD_AIMMR_P15 Peripheral CD Status. **/
#define PIOD_AIMMR_P15		(1 << 15)
/** PIOD_AIMMR_P14 Peripheral CD Status. **/
#define PIOD_AIMMR_P14		(1 << 14)
/** PIOD_AIMMR_P13 Peripheral CD Status. **/
#define PIOD_AIMMR_P13		(1 << 13)
/** PIOD_AIMMR_P12 Peripheral CD Status. **/
#define PIOD_AIMMR_P12		(1 << 12)
/** PIOD_AIMMR_P11 Peripheral CD Status. **/
#define PIOD_AIMMR_P11		(1 << 11)
/** PIOD_AIMMR_P10 Peripheral CD Status. **/
#define PIOD_AIMMR_P10		(1 << 10)
/** PIOD_AIMMR_P9 Peripheral CD Status. **/
#define PIOD_AIMMR_P9		(1 << 9)
/** PIOD_AIMMR_P8 Peripheral CD Status. **/
#define PIOD_AIMMR_P8		(1 << 8)
/** PIOD_AIMMR_P7 Peripheral CD Status. **/
#define PIOD_AIMMR_P7		(1 << 7)
/** PIOD_AIMMR_P6 Peripheral CD Status. **/
#define PIOD_AIMMR_P6		(1 << 6)
/** PIOD_AIMMR_P5 Peripheral CD Status. **/
#define PIOD_AIMMR_P5		(1 << 5)
/** PIOD_AIMMR_P4 Peripheral CD Status. **/
#define PIOD_AIMMR_P4		(1 << 4)
/** PIOD_AIMMR_P3 Peripheral CD Status. **/
#define PIOD_AIMMR_P3		(1 << 3)
/** PIOD_AIMMR_P2 Peripheral CD Status. **/
#define PIOD_AIMMR_P2		(1 << 2)
/** PIOD_AIMMR_P1 Peripheral CD Status. **/
#define PIOD_AIMMR_P1		(1 << 1)
/** PIOD_AIMMR_P0 Peripheral CD Status. **/
#define PIOD_AIMMR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_esr ESR Edge Select Register
@{*/

/** PIOD_ESR_P31 Edge Interrupt Selection. **/
#define PIOD_ESR_P31		(1 << 31)
/** PIOD_ESR_P30 Edge Interrupt Selection. **/
#define PIOD_ESR_P30		(1 << 30)
/** PIOD_ESR_P29 Edge Interrupt Selection. **/
#define PIOD_ESR_P29		(1 << 29)
/** PIOD_ESR_P28 Edge Interrupt Selection. **/
#define PIOD_ESR_P28		(1 << 28)
/** PIOD_ESR_P27 Edge Interrupt Selection. **/
#define PIOD_ESR_P27		(1 << 27)
/** PIOD_ESR_P26 Edge Interrupt Selection. **/
#define PIOD_ESR_P26		(1 << 26)
/** PIOD_ESR_P25 Edge Interrupt Selection. **/
#define PIOD_ESR_P25		(1 << 25)
/** PIOD_ESR_P24 Edge Interrupt Selection. **/
#define PIOD_ESR_P24		(1 << 24)
/** PIOD_ESR_P23 Edge Interrupt Selection. **/
#define PIOD_ESR_P23		(1 << 23)
/** PIOD_ESR_P22 Edge Interrupt Selection. **/
#define PIOD_ESR_P22		(1 << 22)
/** PIOD_ESR_P21 Edge Interrupt Selection. **/
#define PIOD_ESR_P21		(1 << 21)
/** PIOD_ESR_P20 Edge Interrupt Selection. **/
#define PIOD_ESR_P20		(1 << 20)
/** PIOD_ESR_P19 Edge Interrupt Selection. **/
#define PIOD_ESR_P19		(1 << 19)
/** PIOD_ESR_P18 Edge Interrupt Selection. **/
#define PIOD_ESR_P18		(1 << 18)
/** PIOD_ESR_P17 Edge Interrupt Selection. **/
#define PIOD_ESR_P17		(1 << 17)
/** PIOD_ESR_P16 Edge Interrupt Selection. **/
#define PIOD_ESR_P16		(1 << 16)
/** PIOD_ESR_P15 Edge Interrupt Selection. **/
#define PIOD_ESR_P15		(1 << 15)
/** PIOD_ESR_P14 Edge Interrupt Selection. **/
#define PIOD_ESR_P14		(1 << 14)
/** PIOD_ESR_P13 Edge Interrupt Selection. **/
#define PIOD_ESR_P13		(1 << 13)
/** PIOD_ESR_P12 Edge Interrupt Selection. **/
#define PIOD_ESR_P12		(1 << 12)
/** PIOD_ESR_P11 Edge Interrupt Selection. **/
#define PIOD_ESR_P11		(1 << 11)
/** PIOD_ESR_P10 Edge Interrupt Selection. **/
#define PIOD_ESR_P10		(1 << 10)
/** PIOD_ESR_P9 Edge Interrupt Selection. **/
#define PIOD_ESR_P9		(1 << 9)
/** PIOD_ESR_P8 Edge Interrupt Selection. **/
#define PIOD_ESR_P8		(1 << 8)
/** PIOD_ESR_P7 Edge Interrupt Selection. **/
#define PIOD_ESR_P7		(1 << 7)
/** PIOD_ESR_P6 Edge Interrupt Selection. **/
#define PIOD_ESR_P6		(1 << 6)
/** PIOD_ESR_P5 Edge Interrupt Selection. **/
#define PIOD_ESR_P5		(1 << 5)
/** PIOD_ESR_P4 Edge Interrupt Selection. **/
#define PIOD_ESR_P4		(1 << 4)
/** PIOD_ESR_P3 Edge Interrupt Selection. **/
#define PIOD_ESR_P3		(1 << 3)
/** PIOD_ESR_P2 Edge Interrupt Selection. **/
#define PIOD_ESR_P2		(1 << 2)
/** PIOD_ESR_P1 Edge Interrupt Selection. **/
#define PIOD_ESR_P1		(1 << 1)
/** PIOD_ESR_P0 Edge Interrupt Selection. **/
#define PIOD_ESR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_lsr LSR Level Select Register
@{*/

/** PIOD_LSR_P31 Level Interrupt Selection. **/
#define PIOD_LSR_P31		(1 << 31)
/** PIOD_LSR_P30 Level Interrupt Selection. **/
#define PIOD_LSR_P30		(1 << 30)
/** PIOD_LSR_P29 Level Interrupt Selection. **/
#define PIOD_LSR_P29		(1 << 29)
/** PIOD_LSR_P28 Level Interrupt Selection. **/
#define PIOD_LSR_P28		(1 << 28)
/** PIOD_LSR_P27 Level Interrupt Selection. **/
#define PIOD_LSR_P27		(1 << 27)
/** PIOD_LSR_P26 Level Interrupt Selection. **/
#define PIOD_LSR_P26		(1 << 26)
/** PIOD_LSR_P25 Level Interrupt Selection. **/
#define PIOD_LSR_P25		(1 << 25)
/** PIOD_LSR_P24 Level Interrupt Selection. **/
#define PIOD_LSR_P24		(1 << 24)
/** PIOD_LSR_P23 Level Interrupt Selection. **/
#define PIOD_LSR_P23		(1 << 23)
/** PIOD_LSR_P22 Level Interrupt Selection. **/
#define PIOD_LSR_P22		(1 << 22)
/** PIOD_LSR_P21 Level Interrupt Selection. **/
#define PIOD_LSR_P21		(1 << 21)
/** PIOD_LSR_P20 Level Interrupt Selection. **/
#define PIOD_LSR_P20		(1 << 20)
/** PIOD_LSR_P19 Level Interrupt Selection. **/
#define PIOD_LSR_P19		(1 << 19)
/** PIOD_LSR_P18 Level Interrupt Selection. **/
#define PIOD_LSR_P18		(1 << 18)
/** PIOD_LSR_P17 Level Interrupt Selection. **/
#define PIOD_LSR_P17		(1 << 17)
/** PIOD_LSR_P16 Level Interrupt Selection. **/
#define PIOD_LSR_P16		(1 << 16)
/** PIOD_LSR_P15 Level Interrupt Selection. **/
#define PIOD_LSR_P15		(1 << 15)
/** PIOD_LSR_P14 Level Interrupt Selection. **/
#define PIOD_LSR_P14		(1 << 14)
/** PIOD_LSR_P13 Level Interrupt Selection. **/
#define PIOD_LSR_P13		(1 << 13)
/** PIOD_LSR_P12 Level Interrupt Selection. **/
#define PIOD_LSR_P12		(1 << 12)
/** PIOD_LSR_P11 Level Interrupt Selection. **/
#define PIOD_LSR_P11		(1 << 11)
/** PIOD_LSR_P10 Level Interrupt Selection. **/
#define PIOD_LSR_P10		(1 << 10)
/** PIOD_LSR_P9 Level Interrupt Selection. **/
#define PIOD_LSR_P9		(1 << 9)
/** PIOD_LSR_P8 Level Interrupt Selection. **/
#define PIOD_LSR_P8		(1 << 8)
/** PIOD_LSR_P7 Level Interrupt Selection. **/
#define PIOD_LSR_P7		(1 << 7)
/** PIOD_LSR_P6 Level Interrupt Selection. **/
#define PIOD_LSR_P6		(1 << 6)
/** PIOD_LSR_P5 Level Interrupt Selection. **/
#define PIOD_LSR_P5		(1 << 5)
/** PIOD_LSR_P4 Level Interrupt Selection. **/
#define PIOD_LSR_P4		(1 << 4)
/** PIOD_LSR_P3 Level Interrupt Selection. **/
#define PIOD_LSR_P3		(1 << 3)
/** PIOD_LSR_P2 Level Interrupt Selection. **/
#define PIOD_LSR_P2		(1 << 2)
/** PIOD_LSR_P1 Level Interrupt Selection. **/
#define PIOD_LSR_P1		(1 << 1)
/** PIOD_LSR_P0 Level Interrupt Selection. **/
#define PIOD_LSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_elsr ELSR Edge/Level Status Register
@{*/

/** PIOD_ELSR_P31 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P31		(1 << 31)
/** PIOD_ELSR_P30 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P30		(1 << 30)
/** PIOD_ELSR_P29 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P29		(1 << 29)
/** PIOD_ELSR_P28 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P28		(1 << 28)
/** PIOD_ELSR_P27 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P27		(1 << 27)
/** PIOD_ELSR_P26 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P26		(1 << 26)
/** PIOD_ELSR_P25 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P25		(1 << 25)
/** PIOD_ELSR_P24 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P24		(1 << 24)
/** PIOD_ELSR_P23 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P23		(1 << 23)
/** PIOD_ELSR_P22 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P22		(1 << 22)
/** PIOD_ELSR_P21 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P21		(1 << 21)
/** PIOD_ELSR_P20 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P20		(1 << 20)
/** PIOD_ELSR_P19 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P19		(1 << 19)
/** PIOD_ELSR_P18 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P18		(1 << 18)
/** PIOD_ELSR_P17 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P17		(1 << 17)
/** PIOD_ELSR_P16 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P16		(1 << 16)
/** PIOD_ELSR_P15 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P15		(1 << 15)
/** PIOD_ELSR_P14 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P14		(1 << 14)
/** PIOD_ELSR_P13 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P13		(1 << 13)
/** PIOD_ELSR_P12 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P12		(1 << 12)
/** PIOD_ELSR_P11 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P11		(1 << 11)
/** PIOD_ELSR_P10 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P10		(1 << 10)
/** PIOD_ELSR_P9 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P9		(1 << 9)
/** PIOD_ELSR_P8 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P8		(1 << 8)
/** PIOD_ELSR_P7 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P7		(1 << 7)
/** PIOD_ELSR_P6 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P6		(1 << 6)
/** PIOD_ELSR_P5 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P5		(1 << 5)
/** PIOD_ELSR_P4 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P4		(1 << 4)
/** PIOD_ELSR_P3 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P3		(1 << 3)
/** PIOD_ELSR_P2 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P2		(1 << 2)
/** PIOD_ELSR_P1 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P1		(1 << 1)
/** PIOD_ELSR_P0 Edge/Level Interrupt source selection. **/
#define PIOD_ELSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_fellsr FELLSR Falling Edge/Low Level Select Register
@{*/

/** PIOD_FELLSR_P31 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P31		(1 << 31)
/** PIOD_FELLSR_P30 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P30		(1 << 30)
/** PIOD_FELLSR_P29 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P29		(1 << 29)
/** PIOD_FELLSR_P28 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P28		(1 << 28)
/** PIOD_FELLSR_P27 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P27		(1 << 27)
/** PIOD_FELLSR_P26 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P26		(1 << 26)
/** PIOD_FELLSR_P25 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P25		(1 << 25)
/** PIOD_FELLSR_P24 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P24		(1 << 24)
/** PIOD_FELLSR_P23 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P23		(1 << 23)
/** PIOD_FELLSR_P22 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P22		(1 << 22)
/** PIOD_FELLSR_P21 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P21		(1 << 21)
/** PIOD_FELLSR_P20 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P20		(1 << 20)
/** PIOD_FELLSR_P19 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P19		(1 << 19)
/** PIOD_FELLSR_P18 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P18		(1 << 18)
/** PIOD_FELLSR_P17 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P17		(1 << 17)
/** PIOD_FELLSR_P16 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P16		(1 << 16)
/** PIOD_FELLSR_P15 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P15		(1 << 15)
/** PIOD_FELLSR_P14 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P14		(1 << 14)
/** PIOD_FELLSR_P13 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P13		(1 << 13)
/** PIOD_FELLSR_P12 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P12		(1 << 12)
/** PIOD_FELLSR_P11 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P11		(1 << 11)
/** PIOD_FELLSR_P10 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P10		(1 << 10)
/** PIOD_FELLSR_P9 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P9		(1 << 9)
/** PIOD_FELLSR_P8 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P8		(1 << 8)
/** PIOD_FELLSR_P7 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P7		(1 << 7)
/** PIOD_FELLSR_P6 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P6		(1 << 6)
/** PIOD_FELLSR_P5 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P5		(1 << 5)
/** PIOD_FELLSR_P4 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P4		(1 << 4)
/** PIOD_FELLSR_P3 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P3		(1 << 3)
/** PIOD_FELLSR_P2 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P2		(1 << 2)
/** PIOD_FELLSR_P1 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P1		(1 << 1)
/** PIOD_FELLSR_P0 Falling Edge/Low Level Interrupt Selection. **/
#define PIOD_FELLSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_rehlsr REHLSR Rising Edge/ High Level Select Register
@{*/

/** PIOD_REHLSR_P31 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P31		(1 << 31)
/** PIOD_REHLSR_P30 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P30		(1 << 30)
/** PIOD_REHLSR_P29 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P29		(1 << 29)
/** PIOD_REHLSR_P28 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P28		(1 << 28)
/** PIOD_REHLSR_P27 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P27		(1 << 27)
/** PIOD_REHLSR_P26 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P26		(1 << 26)
/** PIOD_REHLSR_P25 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P25		(1 << 25)
/** PIOD_REHLSR_P24 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P24		(1 << 24)
/** PIOD_REHLSR_P23 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P23		(1 << 23)
/** PIOD_REHLSR_P22 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P22		(1 << 22)
/** PIOD_REHLSR_P21 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P21		(1 << 21)
/** PIOD_REHLSR_P20 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P20		(1 << 20)
/** PIOD_REHLSR_P19 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P19		(1 << 19)
/** PIOD_REHLSR_P18 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P18		(1 << 18)
/** PIOD_REHLSR_P17 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P17		(1 << 17)
/** PIOD_REHLSR_P16 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P16		(1 << 16)
/** PIOD_REHLSR_P15 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P15		(1 << 15)
/** PIOD_REHLSR_P14 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P14		(1 << 14)
/** PIOD_REHLSR_P13 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P13		(1 << 13)
/** PIOD_REHLSR_P12 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P12		(1 << 12)
/** PIOD_REHLSR_P11 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P11		(1 << 11)
/** PIOD_REHLSR_P10 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P10		(1 << 10)
/** PIOD_REHLSR_P9 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P9		(1 << 9)
/** PIOD_REHLSR_P8 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P8		(1 << 8)
/** PIOD_REHLSR_P7 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P7		(1 << 7)
/** PIOD_REHLSR_P6 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P6		(1 << 6)
/** PIOD_REHLSR_P5 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P5		(1 << 5)
/** PIOD_REHLSR_P4 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P4		(1 << 4)
/** PIOD_REHLSR_P3 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P3		(1 << 3)
/** PIOD_REHLSR_P2 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P2		(1 << 2)
/** PIOD_REHLSR_P1 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P1		(1 << 1)
/** PIOD_REHLSR_P0 Rising Edge /High Level Interrupt Selection. **/
#define PIOD_REHLSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_frlhsr FRLHSR Fall/Rise - Low/High Status Register
@{*/

/** PIOD_FRLHSR_P31 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P31		(1 << 31)
/** PIOD_FRLHSR_P30 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P30		(1 << 30)
/** PIOD_FRLHSR_P29 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P29		(1 << 29)
/** PIOD_FRLHSR_P28 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P28		(1 << 28)
/** PIOD_FRLHSR_P27 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P27		(1 << 27)
/** PIOD_FRLHSR_P26 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P26		(1 << 26)
/** PIOD_FRLHSR_P25 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P25		(1 << 25)
/** PIOD_FRLHSR_P24 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P24		(1 << 24)
/** PIOD_FRLHSR_P23 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P23		(1 << 23)
/** PIOD_FRLHSR_P22 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P22		(1 << 22)
/** PIOD_FRLHSR_P21 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P21		(1 << 21)
/** PIOD_FRLHSR_P20 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P20		(1 << 20)
/** PIOD_FRLHSR_P19 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P19		(1 << 19)
/** PIOD_FRLHSR_P18 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P18		(1 << 18)
/** PIOD_FRLHSR_P17 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P17		(1 << 17)
/** PIOD_FRLHSR_P16 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P16		(1 << 16)
/** PIOD_FRLHSR_P15 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P15		(1 << 15)
/** PIOD_FRLHSR_P14 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P14		(1 << 14)
/** PIOD_FRLHSR_P13 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P13		(1 << 13)
/** PIOD_FRLHSR_P12 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P12		(1 << 12)
/** PIOD_FRLHSR_P11 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P11		(1 << 11)
/** PIOD_FRLHSR_P10 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P10		(1 << 10)
/** PIOD_FRLHSR_P9 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P9		(1 << 9)
/** PIOD_FRLHSR_P8 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P8		(1 << 8)
/** PIOD_FRLHSR_P7 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P7		(1 << 7)
/** PIOD_FRLHSR_P6 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P6		(1 << 6)
/** PIOD_FRLHSR_P5 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P5		(1 << 5)
/** PIOD_FRLHSR_P4 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P4		(1 << 4)
/** PIOD_FRLHSR_P3 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P3		(1 << 3)
/** PIOD_FRLHSR_P2 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P2		(1 << 2)
/** PIOD_FRLHSR_P1 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P1		(1 << 1)
/** PIOD_FRLHSR_P0 Edge /Level Interrupt Source Selection. **/
#define PIOD_FRLHSR_P0		(1 << 0)

/**@}*/

