grevaillot/svd_tools/headers/ATSAM3X8H/piod.h
/** @defgroup piod_locksr LOCKSR Lock Status
@{*/

/** PIOD_LOCKSR_P31 Lock Status. **/
#define PIOD_LOCKSR_P31		(1 << 31)
/** PIOD_LOCKSR_P30 Lock Status. **/
#define PIOD_LOCKSR_P30		(1 << 30)
/** PIOD_LOCKSR_P29 Lock Status. **/
#define PIOD_LOCKSR_P29		(1 << 29)
/** PIOD_LOCKSR_P28 Lock Status. **/
#define PIOD_LOCKSR_P28		(1 << 28)
/** PIOD_LOCKSR_P27 Lock Status. **/
#define PIOD_LOCKSR_P27		(1 << 27)
/** PIOD_LOCKSR_P26 Lock Status. **/
#define PIOD_LOCKSR_P26		(1 << 26)
/** PIOD_LOCKSR_P25 Lock Status. **/
#define PIOD_LOCKSR_P25		(1 << 25)
/** PIOD_LOCKSR_P24 Lock Status. **/
#define PIOD_LOCKSR_P24		(1 << 24)
/** PIOD_LOCKSR_P23 Lock Status. **/
#define PIOD_LOCKSR_P23		(1 << 23)
/** PIOD_LOCKSR_P22 Lock Status. **/
#define PIOD_LOCKSR_P22		(1 << 22)
/** PIOD_LOCKSR_P21 Lock Status. **/
#define PIOD_LOCKSR_P21		(1 << 21)
/** PIOD_LOCKSR_P20 Lock Status. **/
#define PIOD_LOCKSR_P20		(1 << 20)
/** PIOD_LOCKSR_P19 Lock Status. **/
#define PIOD_LOCKSR_P19		(1 << 19)
/** PIOD_LOCKSR_P18 Lock Status. **/
#define PIOD_LOCKSR_P18		(1 << 18)
/** PIOD_LOCKSR_P17 Lock Status. **/
#define PIOD_LOCKSR_P17		(1 << 17)
/** PIOD_LOCKSR_P16 Lock Status. **/
#define PIOD_LOCKSR_P16		(1 << 16)
/** PIOD_LOCKSR_P15 Lock Status. **/
#define PIOD_LOCKSR_P15		(1 << 15)
/** PIOD_LOCKSR_P14 Lock Status. **/
#define PIOD_LOCKSR_P14		(1 << 14)
/** PIOD_LOCKSR_P13 Lock Status. **/
#define PIOD_LOCKSR_P13		(1 << 13)
/** PIOD_LOCKSR_P12 Lock Status. **/
#define PIOD_LOCKSR_P12		(1 << 12)
/** PIOD_LOCKSR_P11 Lock Status. **/
#define PIOD_LOCKSR_P11		(1 << 11)
/** PIOD_LOCKSR_P10 Lock Status. **/
#define PIOD_LOCKSR_P10		(1 << 10)
/** PIOD_LOCKSR_P9 Lock Status. **/
#define PIOD_LOCKSR_P9		(1 << 9)
/** PIOD_LOCKSR_P8 Lock Status. **/
#define PIOD_LOCKSR_P8		(1 << 8)
/** PIOD_LOCKSR_P7 Lock Status. **/
#define PIOD_LOCKSR_P7		(1 << 7)
/** PIOD_LOCKSR_P6 Lock Status. **/
#define PIOD_LOCKSR_P6		(1 << 6)
/** PIOD_LOCKSR_P5 Lock Status. **/
#define PIOD_LOCKSR_P5		(1 << 5)
/** PIOD_LOCKSR_P4 Lock Status. **/
#define PIOD_LOCKSR_P4		(1 << 4)
/** PIOD_LOCKSR_P3 Lock Status. **/
#define PIOD_LOCKSR_P3		(1 << 3)
/** PIOD_LOCKSR_P2 Lock Status. **/
#define PIOD_LOCKSR_P2		(1 << 2)
/** PIOD_LOCKSR_P1 Lock Status. **/
#define PIOD_LOCKSR_P1		(1 << 1)
/** PIOD_LOCKSR_P0 Lock Status. **/
#define PIOD_LOCKSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_wpmr WPMR Write Protect Mode Register
@{*/


#define PIOD_WPMR_WPKEY_SHIFT		8
#define PIOD_WPMR_WPKEY_MASK		0xffffff
/** @defgroup piod_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** PIOD_WPMR_WPEN Write Protect Enable **/
#define PIOD_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup piod_wpsr WPSR Write Protect Status Register
@{*/


#define PIOD_WPSR_WPVSRC_SHIFT		8
#define PIOD_WPSR_WPVSRC_MASK		0xffff
/** @defgroup piod_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** PIOD_WPSR_WPVS Write Protect Violation Status **/
#define PIOD_WPSR_WPVS		(1 << 0)

/**@}*/
